[
  {
    "url": "https://www.bbc.com/news/articles/cp37e8kw3lwo",
    "heading": "Modi and Xi meet: Trump as the wildcard and other takeaways",
    "content": "Just a few months ago, the armed forces of India and Pakistan were locked in a brief but deadly conflict.The conflict indirectly involved a third nation – China. Pakistan's armed forces heavily used China-made equipment, including fighter jets and radar systems.A senior army officer in Delhi said Beijing also provided \"live inputs\" to Pakistan on Indian positions. India didn't take a public stand against China, but this left many asking if Delhi should continue on the path of normalising relations with Beijing.Less than six months later, peace talks between the two Asian giants have been turbocharged by decisions taken thousands of miles away in Washington DC.The Trump administration has imposed 50% tariffs on Indian imports, saying Delhi was being punished for its refusal to stop buying oil from Russia.Delhi had two clear choices after this stunning onslaught from a trusted ally. The first was to cave in and stop buying Russian oil. But it has refused to do so, largely because Russia is an \"all-weather\" ally and giving into pressure doesn't suit Indian Prime Minister Narendra Modi's strongman image.The second was to stand firm and seek other opportunities and India appears to have to chosen this option for now.It's also pragmatic to look no further when your neighbour is the world's second-largest economy and a global manufacturing powerhouse.It was in this context, that Modi met Chinese President Xi Jinping in Tianjin over the weekend. Statements from the two sides were not heavy on details, though they promised to work through their differences to benefit their collective population of 2.8 billion people.The immediate takeaway from the meeting was the resumption of direct flights between the two countries and making the process of issuing visas simpler.But beyond the promise of \"the elephant and the dragon\" coming together, the two countries still have major roadblocks to clear before they are able to engage meaningfully.Their first challenge comes from their immediate history. Modi has invested personally in the India-China relationship since coming to power in 2014, visiting the neighbouring country five times until 2018.But the 2020 border clash put brakes on this momentum and it has taken seven long years for Modi to visit China again.The key to making further progress will depend on how the two countries deal with their border issues.Tens of thousands of troops from both countries are still deployed at their contested borders - though there are ongoing talks between their civilian and military leaders to ease the situation.\n\nJust a few months ago, the armed forces of India and Pakistan were locked in a brief but deadly conflict.The conflict indirectly involved a third nation – China. Pakistan's armed forces heavily used China-made equipment, including fighter jets and radar systems.A senior army officer in Delhi said Beijing also provided \"live inputs\" to Pakistan on Indian positions. India didn't take a public stand against China, but this left many asking if Delhi should continue on the path of normalising relations with Beijing.Less than six months later, peace talks between the two Asian giants have been turbocharged by decisions taken thousands of miles away in Washington DC.The Trump administration has imposed 50% tariffs on Indian imports, saying Delhi was being punished for its refusal to stop buying oil from Russia.Delhi had two clear choices after this stunning onslaught from a trusted ally. The first was to cave in and stop buying Russian oil. But it has refused to do so, largely because Russia is an \"all-weather\" ally and giving into pressure doesn't suit Indian Prime Minister Narendra Modi's strongman image.The second was to stand firm and seek other opportunities and India appears to have to chosen this option for now.It's also pragmatic to look no further when your neighbour is the world's second-largest economy and a global manufacturing powerhouse.It was in this context, that Modi met Chinese President Xi Jinping in Tianjin over the weekend. Statements from the two sides were not heavy on details, though they promised to work through their differences to benefit their collective population of 2.8 billion people.The immediate takeaway from the meeting was the resumption of direct flights between the two countries and making the process of issuing visas simpler.But beyond the promise of \"the elephant and the dragon\" coming together, the two countries still have major roadblocks to clear before they are able to engage meaningfully.Their first challenge comes from their immediate history. Modi has invested personally in the India-China relationship since coming to power in 2014, visiting the neighbouring country five times until 2018.But the 2020 border clash put brakes on this momentum and it has taken seven long years for Modi to visit China again.The key to making further progress will depend on how the two countries deal with their border issues.Tens of thousands of troops from both countries are still deployed at their contested borders - though there are ongoing talks between their civilian and military leaders to ease the situation.\n\nBoth Chinese and Indian readouts after the meeting this weekend talked about maintaining peace at the border and \"not turning their differences into disputes\".For India, there is the issue of a burgeoning trade deficit with China, amounting to more than $99bn (£73bn).Both countries still have high tariffs and duties against each other in many sectors.Beijing would want India to open its market of 1.4 billion people to Chinese products, but Delhi would be wary of doing that without addressing the deficit.The outreach to China, which started with Modi meeting Xi in Kazan last year, may have been supercharged by Trump tariffs, but ground realities for India remain unchanged. The Modi-Xi meeting is being seen as part of India's policy of \"strategic autonomy\" but it will also cause more geopolitical challenges for Delhi.India is due to host the Quad (which includes Japan, Australia and the US) summit later this year. The forum was largely seen as a challenge to China's dominance in the Indo-Pacific region.It's not clear if Trump will attend, but if he does and says something against China, it will immediately test the renewed synergy between Delhi and Beijing.Delhi is also part of several other multilateral forums that are perceived as anti-China and anti-Russia.How Delhi plays its strategic autonomy in the next few months will very much influence the direction India-China ties take.For now, it's clear that India-US ties are at an all-time low. A Trump aide recently called the Russia-Ukraine conflict \"Modi's war\".Delhi has also consistently denied that Trump played any role in the ceasefire between India and Pakistan in May – this has become a constant irritant for the US president.Despite this, India has refrained from imposing retaliatory tariffs against the US and has left the door ajar for further negotiations. After all, the US is India's biggest trading partner.Will going closer to China help India's negotiations with the US or will it have the opposite impact?This is the question that will likely dominate geopolitical discussions in Delhi and beyond in the coming months.\n\nWhen Xi Jinping met Narendra Modi he used what has become his favourite catchphrase for China-India relations: \"The dragon and the elephant should come together\".During \"this period of transformation,\" he added that it was vital for the world's most populous nations to be friends and good neighbours.In a case of spectacular timing, Prime Minister Modi's visit has coincided with Donald Trump's tariffs of up to 50% on India exports to the US. This represents quite a hit on the country's economy so New Delhi would be looking around for other business partners.Look no further than right here, Xi may well say, as his administration attempts to rebuild from the wreckage of China-India relations following years of tension between the two.And, if their official readouts are anything to go by, Modi's attendance at the Tianjin Summit of the Shanghai Cooperation Organisation seems to have paid off.His published comments to Xi were much more specific than the those coming the other way.There is now a very good window for Beijing and New Delhi to repair their strained relationship.China's leader knows that Donald Trump's tariff onslaught is pushing India away from the United States and that this great economic rival needs other partnerships.Considerable obstacles remain.They include China's backing of India's key rival Pakistan; interaction of all types has been in the doldrums; angry rhetoric from both governments (over many years) has created a climate of suspicion between the Asian heavyweights and their high-mountain border dispute has stirred nationalist sentiment on both sides of the frontier.\n\nHowever, with the latter of these, this meeting would appear to confirm that pressure has already eased.Last Thursday China's Defence Ministry spokesman was talking up the success of discussions between the representatives of China and India aimed at stopping the clashes along their disputed border. He spoke of \"win-win cooperation\" and celebrating the 75th anniversary of ties between the two nations.Xi also knows that the symbolism of having Modi in China right now is considerable, that images of them shaking hands and standing side-by-by side – as the Trump tariffs on India kick in – can be a powerful propaganda tool which is made even more significant by the fact that this is a multilateral gathering.The two will not only be joined by Vladimir Putin but by the other SCO governments like Turkey (a member of Nato), Saudi Arabia (a key US ally), Iran (a key enemy of the US) as well as Qatar, Egypt and Pakistan.And all of this in the days before Beijing holds a massive display of military might with a parade through the heart of the capital.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:45.202757"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4gmnpg31xlo",
    "heading": "China's navy is expanding at breakneck speed - and catching up with the US",
    "content": "\"Socialism is good…\" a pensioner warbles into a portable karaoke mic, slightly off-key and drowned out by her friends' chatter.But they join her for the chorus: \"The Communist Party guides China on the path to power and wealth!\"It is not the catchiest karaoke number. But it is an apt one to belt out as they look towards a horizon framed by cranes towering over ships of all sizes.Suoyuwan park in Dalian, which juts out of north-eastern China into the Yellow Sea,  has stunning views of one of China's largest shipyards, and is a place to gather and be merry. But to White House analysts thousands of miles away in Washington, this cradle of Chinese shipbuilding is part of a growing threat.In the last two decades, China has ramped up investment in shipbuilding. And that has paid off: more than 60% of the world's orders this year have gone to Chinese shipyards. Put simply, China is building more ships than any other country because it can do it faster than anyone else.\"The scale is extraordinary… in many ways eye-watering,\" says Nick Childs, a maritime expert with the London-based International Institute for Strategic Studies. \"The Chinese shipbuilding capacity is something like 200 times overall that of the United States.\"That commanding lead also applies to its navy. The Chinese Communist Party now has the world's largest, operating 234 warships compared to the US Navy's 219.\n\n\"Socialism is good…\" a pensioner warbles into a portable karaoke mic, slightly off-key and drowned out by her friends' chatter.But they join her for the chorus: \"The Communist Party guides China on the path to power and wealth!\"It is not the catchiest karaoke number. But it is an apt one to belt out as they look towards a horizon framed by cranes towering over ships of all sizes.Suoyuwan park in Dalian, which juts out of north-eastern China into the Yellow Sea,  has stunning views of one of China's largest shipyards, and is a place to gather and be merry. But to White House analysts thousands of miles away in Washington, this cradle of Chinese shipbuilding is part of a growing threat.In the last two decades, China has ramped up investment in shipbuilding. And that has paid off: more than 60% of the world's orders this year have gone to Chinese shipyards. Put simply, China is building more ships than any other country because it can do it faster than anyone else.\"The scale is extraordinary… in many ways eye-watering,\" says Nick Childs, a maritime expert with the London-based International Institute for Strategic Studies. \"The Chinese shipbuilding capacity is something like 200 times overall that of the United States.\"That commanding lead also applies to its navy. The Chinese Communist Party now has the world's largest, operating 234 warships compared to the US Navy's 219.\n\nChina's explosive rise has been fuelled by the sea. The world's second-largest economy is home to seven of the world's 10 busiest ports, which are critical to global supply routes. And its coastal cities are thriving because of trade. As Beijing's ambitions have grown, so has its arsenal of ships - and its confidence to stake a louder claim in the South China Sea and beyond.President Xi Jinping's China certainly wants to rule the waves. Whether it will is the question.\n\nA grand military parade in the coming days may reveal just how close it is to that goal. Xi will host Russian President Vladimir Putin and North Korea's leader Kim Jong Un for the event in a defiant message to the Western nations that have shunned them.The US and its allies will be closely watching the photo-op and the display of military might, which is expected to include anti-ship missiles, hypersonic weapons and underwater drones.\"The US Navy, while it still has significant advantages, is seeing the gap in its capabilities with China narrow and is struggling to find a way of answering that,\" Mr Childs says, \"because its shipbuilding capacity has dwindled significantly over the past decades.\"US President Donald Trump has said he wants to fix this, and has signed an executive order to revitalise US shipbuilding and retake America's maritime advantage.That, Mr Childs adds, will be a \"very tall order\".\n\nBetween 2019 and 2023, China's four largest shipyards - Dalian, Guangzhou, Jiangnan and Hudong-Zhonghua - produced 39 warships with a combined displacement of 550,000 tonnes, according to a study by the Center for Strategic and International Studies (CSIS). That is the volume of water they displace, which is the most common way of measuring the size of a vessel or fleet. In comparison, the UK's Royal Navy currently has an estimated total displacement of around 399,000 tonnes. While China has the world's largest navy by number of vessels, the US fleet has a greater overall tonnage and is more powerful - with far more large aircraft carriers.But Beijing is catching up.\"There's no sign that the Chinese are slowing down,\" says Alexander Palmer from the CSIS and author of the report, Unpacking China's Naval Buildup.\"Hull count [number of ships] is not the only measure of a navy's effectiveness of course, but the ability to produce and churn out warships has been extremely impressive and could make a strategic difference.\"\n\nThere are still limits on China's naval rise. Beijing may have more ships, but it only has two operational aircraft carriers, and its navy has far fewer submarines than the US.Some analysts argue they are also not as sophisticated as the American ones, which have a technological head start going back to the the Cold War. The Chinese subs are also largely built for the shallower South China Sea, where a game of cat-and-mouse with the US is already under way. For now, China's ability to travel far from its own coastline is limited.But there are signs this is changing, and fast.Satellite imagery obtained by BBC Verify from Hainan, a Chinese island province in the South China Sea, suggests Beijing is pouring significant funding into expanding its naval bases. The base at Yulin has five new piers which appear to have been constructed in the last five years. It is thought China plans to base all of its largest submarines, the Jin-class (or Type 094), in this port. These new subs can carry 12 nuclear missiles each.\n\nPhotographs and footage of rehearsals, shared on Chinese social media, suggest that at least two new types of unmanned underwater drones, which look like large torpedoes, will be among the new systems on show at next week's parade. These could allow China to carry out surveillance deep underwater and detect other submarines or even undersea cables without risking its own naval forces.Much of the technology is still \"unproven and the timeline of its capabilities is still unclear\", cautions Matthew Funaiole from CSIS's China Power Project. \"The big question is how long will it take for the technology to mature.\"And that's why the US cannot overlook the threat China's shipbuilding represents, he adds.The country's vast naval buildup is being propelled by a party that is still reeling from the pains of the past - and is more than willing to channel them to buttress its message of loyalty, power and patriotism. Holding a massive military parade to commemorate the victory over Japan, and the end of its brutal occupation, is testament to that.\n\nWhat the rest of the world sees as China's rise, Xi sees as its resurgence. He has touted the value of a \"strong navy to safeguard national security\". He cites 470 invasions between 1840 and 1949 that brought \"untold suffering\" - as the once-powerful Qing empire cracked, China plunged into turmoil, revolution and civil war. And he has vowed that his country will never again be \"humiliated\" or relive those \"bitter memories of foreign assaults\".Where China has an undeniable edge is the dual use of shipyards. Many of those that support commercial production can also help produce warships for the navy. Military and civilian shipyards work hand in hand in some places, which state media describes as \"military-civilian fusion\", a concept Xi has pushed hard.Dalian, which Beijing calls a \"flagship shipyard\", plays a big part in this.\n\nIn full view of the picnicking pensioners waving karaoke mics are huge commercial ships, some as long as three football fields. But just around the corner, berthed where no-one can take pictures, is a group of military vessels. There, a crane is lowering a helicopter onto the huge deck of a ship, as a marching band bellows in Suoyuwan park.\"This is a politically motivated agenda to merge both the commercial and military entities together,\" Mr Funaiole says. \"There are efforts to bring the technology needed to build both into a centralised location – Dalian is one of them.\"That is why even without powerful aircraft carriers or submarines, China's commercial fleet and its expertise in building ships quickly can be key during a crisis, he adds.\n\n\"In any protracted conflict, if you have shipyards that quickly produce new ships, this is a huge strategic advantage,\" Mr Funaiole says. \"Commercial ships can transport food etc into any conflict zone. Without this, the US is in a position where it might not be able to sustain a prolonged war effort.\"It boils down to a straight question, he says: \"Who can put more assets into the water more quickly and readily?\"The answer, at the moment, is China.\n\nBut the world should not worry, says Prof Hu Bo, director of the Center for Maritime Strategy Studies at Peking University.\"We have no interest in interfering in the business of other countries, especially militarily,\" he adds. His message is that China is building big ships because it can, not because it wants to take over the world.There is one island which China does not see as another country: Taiwan.Beijing has long vowed to \"reunify\" with the democratic island and has not ruled out the use of force. In recent years, high-ranking US officials have declared that China will invade Taiwan by 2027, but Beijing denies there is a deadline.\"China already has the capacity to take Taiwan back,\" Prof Hu Bo says, \"but China doesn't do that because we have patience. China has never given up on the prospect of peaceful unification. We can wait.\"\n\nThe bigger concern is that any attack on Taiwan could trigger a wider war, and involve the US. Washington is bound by law to provide arms to help Taiwan defend itself - support which is unacceptable to Beijing for what is considers a breakaway province that will eventually be part of China.Earlier this year US Defence Secretary Pete Hegseth warned that China posed an \"imminent\" threat to Taiwan, and urged Asian countries to boost defence spending and work with the US to deter war.So despite Prof Hu Bo's assurances, it is hard to ignore the fact that China's warships are beginning to sail further from the country's shores.In February, they were seen circumnavigating Australia's coastline for more than three weeks where they staged unprecedented live-fire drills. More recently Chinese aircraft carriers conducted naval drills near Japan, sparking concern - although it was in international waters, the move was unprecedented.\n\nAs Beijing grows bolder in its attempts to project power in the Pacific, China's neighbours, from Taiwan to Australia, are worried that its famous mantra is paying off: \"hide your strength and bide your time\".But Prof Hu Bo believes that fears of a conflict between the US, whose allies in the region - Japan, South Korea and Australia - are often at odds with China, are overblown, because they all know it could be catastrophic.\"In the last three years, I think the signal is very clear that both sides don't want to fight,\" he says. \"We are prepared for that, but we don't want to fight with each other.\"\n\nBack in Dalian, around an hour's drive from the vibrant city, tourists are arriving by the coach load in the naval fortress town of Lushunkou, which also has a military theme park in the shape of an aircraft carrier.Guides on loud microphones lead their groups into the park, pointing to the official notices warning visitors not to photograph the military vessels moored in the crescent-shaped harbour and to report any behaviour that might be construed as spying \"to help defend the Motherland\".More military notices on bridges and walls declare, \"united as one, we defend our ocean dream\".China has fostered pride in its shipbuilding prowess, especially here in Dalian.\n\nAt the theme park, which also overlooks the shipyard, a 50-year-old blogger dressed in the local fashion - a floral pattern shirt - is giving his followers their daily rundown of the latest ships being built in the port.\"I am very proud – really, look at what this city gives us,\" he announces to his followers. A mother and her seven-year-old daughter, on holiday from the neighbouring province, marvel at the ships. \"I was amazed. It's huge. How does it sail, I wonder?\"The key question for the US and its allies is how far can China's war fleet sail, and how far from its shores is Beijing prepared to venture.\"At what point will they will break out and be able to really show influence further afield, for example, in the Indian Ocean and beyond, will be a key thing to look at,\" Nick Childs says.\"They still have a significant way to go, but they are certainly pushing the boundaries.\"",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:46.541414"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4gzny0p0n9o",
    "heading": "Fugitive wanted over Australia police killings being helped, police say",
    "content": "A fugitive who allegedly murdered two officers in a small rural Australian town in the state of Victoria is being helped by some members of the community, police have said. Dezi Freeman has been on the run since last Tuesday, when police arrived at his Porepunkah property to execute a search warrant, reportedly relating to a sex crimes investigation.Mr Freeman, a known conspiracy theorist, escaped into thick bushland bordering the property, with a massive manhunt for him now in its seventh day.His wife, Amalia Freeman, had earlier urged him to turn himself in and offered her condolences to the families of the officers he is alleged to have killed.\n\nA fugitive who allegedly murdered two officers in a small rural Australian town in the state of Victoria is being helped by some members of the community, police have said. Dezi Freeman has been on the run since last Tuesday, when police arrived at his Porepunkah property to execute a search warrant, reportedly relating to a sex crimes investigation.Mr Freeman, a known conspiracy theorist, escaped into thick bushland bordering the property, with a massive manhunt for him now in its seventh day.His wife, Amalia Freeman, had earlier urged him to turn himself in and offered her condolences to the families of the officers he is alleged to have killed.\n\nVictoria Police - which has previously appealed for Mr Freeman to surrender - says there has still been no sighting of the 56-year-old. \"People know the whereabouts of the person who has killed two cops,\" Superintendent Brett Kahan said in an update on Monday.\"You are committing an extremely serious crime by harbouring or assisting in the escape of Dezi Freeman.\"He declined to specify how many people police suspected, or whether they were locals in the town of Porepunkah or nearby areas.Police had arrested and promptly released Ms Freeman and a 15-year-old when raiding another Porepunkah property on Thursday night, but have not provided any additional information.Ms Freeman said she and her children \"respected the important work of Victoria Police and do not hold anti-authority views,\" in a statement released by her lawyers. Heavily armed police, helicopters and armoured vehicles have now been searching the area where Dezi Freeman disappeared for almost a week.The killings have revived questions over how Australian authorities deal with the threat of conspiracy theorists - three years after a hauntingly similar ambush of police in Queensland.Mr Freeman had long espoused \"sovereign citizen\" views and had a well-documented hatred of authority.Victoria Police say a thorough risk assessment was conducted before 10 officers had travelled to his property, but specialist police support had not been requested.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:49.273384"
  },
  {
    "url": "https://www.bbc.com/news/articles/c209ql9z2d1o",
    "heading": "Camilla fought off attacker with shoe as teenager, book says",
    "content": "Queen Camilla was the victim of an attempted indecent assault as a teenager, according to a new book about the Royal Family. The Queen is said to have fought off her attacker using the heel of her shoe.The attempted assault is recounted in Power and the Palace by the former Royal editor of the Times newspaper, Valentine Low.He says the Queen told Boris Johnson the story of her experience in 2008 when he was mayor of London.It is reported that the Queen was 16 or 17 years old when the incident happened on a train to Paddington Station.\n\nQueen Camilla was the victim of an attempted indecent assault as a teenager, according to a new book about the Royal Family. The Queen is said to have fought off her attacker using the heel of her shoe.The attempted assault is recounted in Power and the Palace by the former Royal editor of the Times newspaper, Valentine Low.He says the Queen told Boris Johnson the story of her experience in 2008 when he was mayor of London.It is reported that the Queen was 16 or 17 years old when the incident happened on a train to Paddington Station.\n\nThe man is said to have been touching the teenage Camilla Shand when she took off her shoe and hit him with it.It was, she told Johnson, something her mother had told her to do if she ever found herself in that situation.When she arrived in London, she reported the incident to station staff and the man was arrested.Buckingham Palace has made no official statement on the story but is not disputing the details of the account.\n\nQueen sent letter of support to Gisèle PelicotDomestic violence should not be taboo subject, says Queen'It's hard to leave abusive relationships'\n\n\"She did the responsible thing,\" Low told BBC Radio 4's Today programme. \"Not only was she resourceful and strong, she was a responsible citizen in making sure the man was arrested.\"Much of the Queen's public work in recent years has been supporting the victims of domestic violence, sexual assault and rape.She is patron of the charity SafeLives and has visited women's refuges and rape crisis centres across the UK and globally.In a number of powerful speeches, she has spoken of the courage of those who have experienced domestic violence and why they should not feel fear or stigma in coming forward.In a speech in 2020 she said: \"Through my work, I have talked to many women who have lived with coercive control and domestic violence and, thankfully, come out at the other end as the victors not the victims. \"They are some of the bravest people I have ever met. Their stories are harrowing and have reduced even the toughest of their listeners to tears.  That is why it is so vital that these survivors should no longer feel any shame or any blame.\"And at a reception at Clarence House in April for SafeLives, she spoke of domestic abuse.\"I would not be standing here if it was 10 years ago because we wouldn't have been talking about it - it was a taboo subject. Nobody actually wanted to talk about it.\"But now 10 years later we've got survivors telling their story who years ago would've been too ashamed to come forward to tell their stories, but now they'll get up and talk and inspire others to talk.\"Sources close to the Queen say she has not gone public with the attempted attack before to avoid drawing attention to her experience rather than to the victims she now works with.They also say this episode did not motivate the Queen to get involved in supporting domestic violence organisations as that work stemmed from hearing victims stories over the years.\"She didn't want to draw attention to her at the expense of their experiences,\" Low explained.\"She's heard a lot of the stories over the years and she's got a very deep seated, sincere interest in this issue and it doesn't all spring from one incident when she was a teenager.\"Royal sources also say if discussion around the Queen's past experience helps destigmatise what far too many girls still suffer today, then that would be a positive from what was a negative episode.Over the weekend, the Times also reported that Elizabeth II wanted to remain in the European Union at the time of Brexit.Low told the BBC: \"If anything, the late Queen was a reluctant remainer as so many of us were.\"A lot of people in this country were very critical of the EU... but they didn't want to change, they thought that we would not be better off out. I think that's what she felt.\"She certainly had criticisms of the EU.\"Low also recounted the politics of the Prince of Wales, who Low said has \"always been at huge pains to make sure he's not treading on any political toes\".On Prince William's homeless charity, launched in 2023, Low said the prince spoke to ministers first so as to not \"upset them\".\"I think it's possible a slightly different approach to what his father had.\"Details of help and support with child sexual abuse and sexual abuse or violence are available in the UK at BBC Action Line.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:50.310287"
  },
  {
    "url": "https://www.bbc.com/news/articles/ckgy3g7zpl3o",
    "heading": "What is at stake in Malawi's elections?",
    "content": "The people of Malawi are set to vote for their next leader, following a turbulent five years involving economic turmoil, natural disasters and the shock death of the nation's vice-president. Current President Lazarus Chakwera is vying for a second term, his main rival being Peter Mutharika, an octogenarian who has also held office in the southern African nation once before.Transparency and fairness are key talking points ahead of the vote, given that the result of Malawi's 2019 presidential election was overturned in the courts due to widespread irregularities.\n\nThe people of Malawi are set to vote for their next leader, following a turbulent five years involving economic turmoil, natural disasters and the shock death of the nation's vice-president. Current President Lazarus Chakwera is vying for a second term, his main rival being Peter Mutharika, an octogenarian who has also held office in the southern African nation once before.Transparency and fairness are key talking points ahead of the vote, given that the result of Malawi's 2019 presidential election was overturned in the courts due to widespread irregularities.\n\nPolling day is Tuesday 16 September 2025.\n\nThe 7.2 million registered voters will be taking part in three elections:Presidential - there are 17 candidates to choose fromParliamentary - 229 constituency MPs will be electedLocal -  509 councillor positions are up for grabs.\n\nAmong the 17 hopefuls there are two clear front-runners. Chakwera and Mutharika will square off against each other at the polls for the third time. Mutharika won in 2019, but that result was annulled. Chakwera won the re-run the following year.Lazarus Chakwera - Malawi Congress Party (MCP)Chakwera, a former theology lecturer and preacher, had no political experience when he emerged as leader of the MCP in 2013.When he ran for president in 2014 he was unsuccessful, but in 2020 he triumphed, beating the incumbent, Mutharika, in that unprecedented re-run.Chakwera's time in office has been marred by economic turmoil and allegations of corruption. The 70-year-old did, however, reintroduce train services in Malawi for the first time in over three decades. He has also overseen major road construction across the country.Peter Mutharika - Democratic Progressive Party (DPP)Mutharika, an 85-year-old former lawyer and law lecturer, led Malawi from 2014 to 2020.He is the brother of the late President Bingu wa Mutharika, who died in office in 2012. Like Chakwera, Mutharika is also burdened by corruption allegations and links to economic crises. However, his supporters would argue that the current high inflation rate (around 27%) is proof that Mutharika managed the economy better than his successor.Mutharika's age may count against him this election - speculation about his health is rife, especially as he has rarely been seen out in public during the campaign period.Other contenders garnering attention are former president Joyce Banda (People's Party), current Vice-President Michael Usi (Odya Zake Alibe Mlandu) and former reserve bank governor Dalitso Kabambe (UTM).\n\nThe economyMalawi has long been one of the poorest countries in the world, but the past few years have been especially punishing.The country was devastated by Cyclone Freddy that killed hundreds of people in 2023, then a drought swept across southern Africa the following year. Food prices skyrocketed due to a short supply of crops, pushing many Malawians into extreme poverty.Economists also put Malawi's current inflation problems partly down to the shortage of foreign currencies - known as \"forex\" - in the banks.In addition, Malawi has been forced to devalue its currency and was recently crippled by fuel shortages and nationwide power outages.CorruptionWhen Chakwera came to power, he vowed to \"to clear the rubble of corruption\" that has long plagued Malawian politics. His administration says it has excelled in this area, but critics - including the influential Catholic Church - say this is not the case.Scepticism was sparked last year when the director of public prosecutions dropped corruption charges against high-profile figures. Additionally, Malawi's anti-graft agency, the Anti-Corruption Bureau (ACB), has been without a director since former boss Martha Chizuma left more than a year ago.To some, the failure to appoint a new head actively hinders the fight against corruption.But previous administrations have also been dogged by graft allegations. For instance, the ACB accused Mutharika of receiving a kickback from a contract to supply food to the police - he denied any wrongdoing.Banda's reputation was dented by a scandal dubbed \"cashgate\" which happened under her watch. She was cleared by the ACB of any wrongdoing.The former vice-president's deathIn June last year, Vice-President Saulos Chilima died in a plane crash. Popular with the youth, Chilima led the UTM party and could have been a key contender in the upcoming elections, especially as he had fallen out with the president.Although two investigations - one carried out by Germany's aviation accidents agency and another by a Malawi government-appointed commission - concluded there was no foul play, some Malawians remain suspicious of the authorities. Opposition parties have been fuelling this scepticism during their campaigns, referring to Chakwera's MCP as the \"Malawi Chikangawa Party\" (Chikangawa Forest being the site of the plane crash).\n\nMalawi was governed by the MCP from its independence in 1964 until the country's first multi-party poll in 1994.Since the shift from a one-party state, the United Democratic Front, the DPP, the People's Party and the MCP have all enjoyed stints in power.Chakwera's victory with the MCP in 2020 was one of the most significant moments in the country's political history.A general election had taken place the year before and Mutharika was declared the winner. However, the Constitutional Court annulled the election, saying there had been widespread tampering, including the use of Tipp-Ex correction fluid on ballot papers. Judges ordered a re-run for 2020, and Chakwera won with 59% of the vote after having teamed up with Chilima.Although Mutharika branded the re-run \"unacceptable\", the Constitutional Court gained international acclaim for safeguarding democracy and refusing to be influenced by presidential power.\n\nFollowing the controversy of the 2019 election, Malawi implemented a new system, where a candidate must gain more than 50% of the total votes to win the presidency in the first round.There is a strong possibility that this year's candidates will not reach this threshold in the initial poll, meaning a run-off election will have to be held.The MCP and DPP will likely try to bring other, smaller parties on board in order to secure a majority in the second time round.\n\nThe court's actions following the 2019 vote have given some Malawians faith in the electoral process.However, over the past months, a number or civil society organisations and opposition parties have accused the electoral commission of favouring the MCP, alleging that its top management has links to the governing party. The commission has firmly denied being biased.A protest in June calling for the resignation of the commission's top officials was attacked by masked, machete-wielding men, leading to concerns about freedom of expression in the run-up to the election.The assault was not an isolated incident - there have been numerous reports of politically motivated violence ahead of the general election.\n\nThe outcome of the presidential election will be announced by the end of 24 September.The parliamentary results will be announced by the end of 30 September.\n\nHow brave judges rejected a 'second-rate election''Magnetic' Malawian vice-president dies in plane crash'I tell my children not to play so we save money on soap'Banana wine brings sweet taste of success to Malawi farmersHigh hopes of Malawi cannabis farmers are dashed\n\nGo to BBCAfrica.com for more news from the African continent.Follow us on Twitter @BBCAfrica, on Facebook at BBC Africa or on Instagram at bbcafrica",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:51.312158"
  },
  {
    "url": "https://www.bbc.com/news/articles/cpv0w7njj2jo",
    "heading": "Trump is sending a 'great friend' to India. Some see him as a 'slap in the face'",
    "content": "He's published books authored by Donald Trump, raised millions for his 2024 campaign, and helped him staff Washington with loyalists during the US president's second term.Now Sergio Gor is set to become Trump's man in India, while also overseeing US relations with other South and Central Asian countries.Last week, Trump announced that he was promoting Gor, his personnel chief, to be the next US Ambassador to India. He called Gor a \"great friend\" and someone he could \"fully trust\" to deliver on the agenda.The 38-year-old's appointment comes at a time when relations between the two countries have become strained due to Trump's punishing tariffs on India.Gor's appointment has evoked mixed reactions in India, with some observers saying that having a close Trump aide in the post is a positive sign for India-US ties. But others have questioned Trump's decision to share his India envoy with South and Central Asian countries, which includes Pakistan, with whom India shares a tense relationship.\n\nHe's published books authored by Donald Trump, raised millions for his 2024 campaign, and helped him staff Washington with loyalists during the US president's second term.Now Sergio Gor is set to become Trump's man in India, while also overseeing US relations with other South and Central Asian countries.Last week, Trump announced that he was promoting Gor, his personnel chief, to be the next US Ambassador to India. He called Gor a \"great friend\" and someone he could \"fully trust\" to deliver on the agenda.The 38-year-old's appointment comes at a time when relations between the two countries have become strained due to Trump's punishing tariffs on India.Gor's appointment has evoked mixed reactions in India, with some observers saying that having a close Trump aide in the post is a positive sign for India-US ties. But others have questioned Trump's decision to share his India envoy with South and Central Asian countries, which includes Pakistan, with whom India shares a tense relationship.\n\nExperts say that Gor's broad regional mandate threatens to expose India to an overreach by Washington in its affairs with Pakistan, including on the Kashmir issue - a red line for India. \"The special envoy's additional designation will likely create some challenges, at least in India. India typically prefers not to be \"hyphenated\" with Pakistan,\" says Alyssa Ayres from the Council of Foreign Relations, an American think-tank focussed on US foreign policy.Lawrence Haas, a former senior White House official and senior fellow at the American Foreign Policy Council, says that it could also be Trump's way of signalling to Delhi that he doesn't think the role of ambassador to India needs to be a full-time job.  \"I imagine that India's leaders will feel slighted and insulted, which will further strain US-India relations,\" Mr Haas told the BBC.India found itself in a similar situation in 2009, when the Obama administration reportedly considered appointing Richard Holbrooke as special envoy to Pakistan, Afghanistan and India.Delhi reportedly lobbied against the move, leading to Holbrooke being appointed envoy to Pakistan and Afghanistan.\n\nTrump, however, is no Obama.Unlike his predecessor's caution, Trump openly claimed credit for brokering an end to a recent four-day conflict between India and Pakistan - a claim India flatly denied, insisting no outside power played a role in the ceasefire.The Trump administration has also been bullish in its demands from India in a prospective trade deal, seeking greater access to dairy and farming, sectors India has been keen to protect.It remains to be seen if Gor's presence in India will help smooth out such bumps and strengthen Washington-Delhi ties, or if he is here to crack the whip on Trump's biddings.Trump-Modi ties hit rock bottom with new tariffs on India over Russian oilTrump's 50% tariff on India kicks in as Modi urges self-relianceBill Drexel, a fellow at the Center for Strategy and American Statecraft at the Hudson Institute, says that because decision-making is largely driven by Trump, having an India envoy who's close to him could be a major asset to India-US ties.\"But there may be a steep learning curve given his [Gor's] limited diplomatic and regional experience,\" Mr Drexel says.Ms Ayres echoes a similar view. She says that Gor's closeness with the president could help \"break through\" potential policy logjams.Mr Haas, however, says that Gor's lack of diplomatic experience could pose a problem in an already strained relationship and that the US should have picked an envoy who could help improve the situation. \"Instead, I suspect that Delhi will interpret this appointment as a slap in the face and further evidence that Trump doesn't care about the relationship,\" he says.\n\nGor is said to get along not just with Trump but the entire Trump clan, including Ivanka Trump, Jared Kushner and Donald Trump Jr.Kushner has called Gor \"easygoing\" and \"trusted\". Former congressman Matt Gaetz recalled his fun-loving side, noting he once DJed at MAGA parties in Palm Beach during Trump's exile. Western media, however, largely cast him as one of Trump's most reliable foot soldiers - someone who gets the job done.Gor is known for vetting presidential appointees for loyalty to Trump. In June, Elon Musk branded him a \"snake\" after The New York Post reported that Gor had not filed the paperwork for his own permanent security clearance. The White House insisted Gor held an active clearance and is \"fully compliant\" with requirements.Gor's origins are both unclear and interesting. Though he has been known to describe himself as being Maltese, he was born in 1986 in Uzbekistan when it was still a part of the Soviet Union. He reportedly spent much of his childhood in Malta before moving to the US at 12.Gor is reported to have been interested in Republican politics from his school and college days, when he went by the name Gorokhovsky, which he later shortened to Gor.In 2008, he became a junior staffer at the Republican National Committee and one of his jobs included wearing a squirrel costume at events to highlight Barack Obama's ties to an organisation Republicans accused of indulging in voter fraud.After two years at Fox News, Gor worked with several Republican politicians before joining Trump's fundraising team in 2020. A year later, he co-founded Winning Team Publishing with Donald Trump Jr., which has since released multiple Trump books, including the photobook Save America. Since 2022, he has owned a house in Florida, a short drive from Mar-a-Lago, where he is a frequent visitor.Follow BBC News India on Instagram, YouTube, Twitter and Facebook.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:52.554413"
  },
  {
    "url": "https://www.bbc.com/news/articles/cp37k8ev9glo",
    "heading": "Jewellery boss in £170m scam told shop staff to pretend to be customers",
    "content": "Staff at a luxury jewellery retailer were told to pose as customers to trick investors in the UK's biggest diamond scam, BBC Panorama can reveal.The deception helped diamond dealer Vashi Dominguez get fresh cash from investors to prop up his business, which collapsed in 2023 with £170m of debts.Those investors lost everything when the Vashi retail chain's promised £157m stock of diamonds was later only valued at about £100,000.Mr Dominguez disappeared, but both the Metropolitan Police and the Serious Fraud Office have decided not to investigate.\n\nStaff at a luxury jewellery retailer were told to pose as customers to trick investors in the UK's biggest diamond scam, BBC Panorama can reveal.The deception helped diamond dealer Vashi Dominguez get fresh cash from investors to prop up his business, which collapsed in 2023 with £170m of debts.Those investors lost everything when the Vashi retail chain's promised £157m stock of diamonds was later only valued at about £100,000.Mr Dominguez disappeared, but both the Metropolitan Police and the Serious Fraud Office have decided not to investigate.\n\nBBC Panorama has spoken to former shop staff, investors and the financial experts combing through the wreckage of the company to piece together how Vashi Dominguez fooled so many people - and to ask why authorities are not looking for him.\"This is bigger than Hatton Garden, Brink's-Mat and the Great Train Robbery combined,\" says one of the investors, Michael Moszynski, an advertising executive.\n\nVashi Dominguez made his name supplying diamonds to the rich. His reputation grew as his diamond deals grew bigger.He appeared on ITV's This Morning, chatting with Holly Willoughby and Phillip Schofield, holding a crystal egg, which he claimed was worth £5m and he was selling for a billionaire in Canada.\"Vashi is very dynamic, he's a very charismatic character. He was almost like the Pied Piper of jewellery retail,\" says Will Hayward, a former Vashi store manager.\n\nBy 2017, Mr Dominguez was no longer just a diamond dealer to the rich. He was a High Street brand, with Vashi stores in London, Birmingham and Manchester.Mr Dominguez said he was offering a different kind of jewellery experience, where customers could work with designers and then watch their jewellery being made on site. They were promised high-end diamonds at a cheaper price.\"Vashi was quite a magnetic individual,\" says Mr Moszynski. \"He had gravitas, he had intelligence, he spoke in a very informed way about every detail of his business.\"\n\nVashi Dominguez backed up his ideas with detailed business plans and accounts. He tricked experienced investors like Clive Schlee, the former boss of the sandwich chain Pret a Manger, and John Caudwell, the mobile phone billionaire.Mark Schneider, a media executive who co-founded GB News, decided to invest about £750,000. \"It seemed good. Some smart guys from around here were in the deal, I just kind of went along with it on that basis,\" he says.The business seemed to be booming. In 2021, Mr Dominguez opened a new flagship store on a prime site in Covent Garden, central London. It was fitted out extravagantly, with a large interactive screen and an £8,000 sofa, staff say.\n\nBut on the shop floor, they suspected something was not right.\"After the shininess had worn off, we were getting, like, two, three, four people in it a day, and that was the reality in one of the busiest squares in London,\" says Charlotte Paul, a former data analyst for Vashi.Mr Dominguez tried to bring in more money by tricking investors, telling staff to pretend to be customers so the store would look busy.An email spelled out why: \"This request is direct from Vashi, as he is in major investor conversations and expects surprise store visits.\"\n\nSales staff with no experience of making jewellery were also told to sit at work benches and pretend to be goldsmithing or diamond-setting.\"It was a whole elaborate show that Vashi would do with the clients, to show that they've got so many orders and this is how busy we are - this is why you should really be investing into Vashi,\" says Will Hayward.\"Total facade.\"Customers were also being conned, staff say.Diamonds for sale usually carry inscriptions that record their size and quality, called a GIA number.Lezlie Bailey, who worked as a gemologist at Vashi, says the company was buying smaller or lower-quality diamonds than customers had paid for and scratching off the GIA numbers.But the biggest trick Vashi Dominguez used to cheat investors was in the accounts.The figures sent to investors - and published at Companies House - showed sales of more than £100m in 2021.But they were false. Internal documents show the real sales figures that year were only £5m - just 5% of the published figures.\"To completely misrepresent the accounts by this scale is just completely unacceptable,\" says Stuart McFadden from fraud investigation company Refundee, which represents some investors.\n\nVashi Dominguez's company was on its knees, but the man himself was still living the good life. The company paid for his fleet of luxury cars, including a Lamborghini, and the rent for several flats in prime central London neighbourhoods such as Mayfair.It could not last - and in April 2023, the glitzy jewellery retail business went bust.Investors were shocked but thought their money would be safe, because they had been sent valuations in February showing the company's huge stock of diamonds was worth £157m.\n\nBut they learned this had been another trick. Diamond consultant Rob Wake-Walker, who was brought in to value the gems that April, says: \"Our first question was actually to ask if there was any more.\"The valuation of the diamonds and the dodgy accounts had been signed off by a real accountant: Rajnikant Patel, who works from a small office on a row of shops in Ilford, east London.He did not answer our letters, so I went to see him and asked where the missing money had gone.Mr Patel said he did not know where the money was and did not want to discuss what happened, in case it prejudiced any future court case against Vashi Dominguez.Asked about the investors who had lost money, Mr Patel said he did not think anyone based their decision to invest \"purely on our accounts\".\n\n\"Obviously it's not good. The shareholders, the investors have lost their money. I certainly am very sorry that's happened, but nothing to do with us,\" he said.Mr Patel said he did not know the figures in the accounts were wrong and would not have signed them off if he had known.The liquidator, Benji Dymant, says creditors are owed £170m and that more than £100m of that is owed to investors. Mr Dymant would like to question Mr Dominguez, but he has vanished.His disappearance also means the BBC was unable to put our allegations to him.From bank statements, Mr Dymant says he knows Vashi Dominguez flew to Dubai on the day the court ordered the company to be wound up.\"We have hired private investigators and there have been sightings of him, but we have not been given any hard evidence of a sort of residence or location in a certain place,\" the liquidator says.\n\nVashi Dominguez has cheated investors, staff and the taxman, but the search party is surprisingly small.There is no investigation by the police or the Serious Fraud Office (SFO).Investors are stunned that nothing is being done. \"I mean, what are you actually doing?\" says Mark Schneider, who is American. \"All these people in your country can be ripped off in such an obvious way and you don't bother trying to figure out how to get hold of the person or to deal with the fraud.\"Investors say they were passed between the Metropolitan Police and the SFO, until the SFO eventually said it was not a complex-enough case for it to take on.The SFO told us it only \"takes on a small number of high-level economic crime cases\" each year.The Met Police told us it had \"not received any referrals from the liquidator or the Insolvency Service\" and would reassess if it did.The liquidator says he is not allowed to tell us whether he referred the case to the police or the SFO, but that he has complied with all his requirements.\n\nInvestors think Vashi Dominguez committed the perfect crime and escaped with a fortune.But the liquidator, who has gone through the books, says there is no evidence that he has taken a lot of the missing cash.\"What we haven't seen from the bank statements is significant bulk sums of money, or any obvious sums of the money, that have been put into an offshore account or anything like that,\" says Mr Dymant.Like most investors, Mark Schneider has not got his money back. He still cannot work out whether Vashi was a scam from the beginning.\"I'm not sure whether the guy panicked because this thing just wasn't working like he planned or whether he planned it all along to be like this,\" he says.What we know is Vashi Dominguez used sparkle and glamour to attract tens of millions of pounds from investors.All the money has gone and so has he.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:53.673513"
  },
  {
    "url": "https://www.bbc.com/news/articles/clyrkj0d44vo",
    "heading": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
    "content": "Australia could use a range of technologies to implement its social media ban for under-16s but all have risks or shortcomings, a report has found.The government says its ban, which comes into effect in December, is designed to limit the harmful impacts of social media. The policy has been touted as a world-first and is being watched closely by leaders globally.Under the new laws, platforms must take \"reasonable steps\" to prevent Australian children from creating accounts on their sites, and deactivate existing ones. Though the move is popular with many parents, experts have raised concerns over data privacy and the accuracy of age verification technology.\n\nAustralia could use a range of technologies to implement its social media ban for under-16s but all have risks or shortcomings, a report has found.The government says its ban, which comes into effect in December, is designed to limit the harmful impacts of social media. The policy has been touted as a world-first and is being watched closely by leaders globally.Under the new laws, platforms must take \"reasonable steps\" to prevent Australian children from creating accounts on their sites, and deactivate existing ones. Though the move is popular with many parents, experts have raised concerns over data privacy and the accuracy of age verification technology.\n\nThe federal government commissioned the UK-based Age Check Certification Scheme to test the ways Australia could enforce the ban, and its final report was published on Sunday.It looked at a variety of methods - including formal verification using government documents, parental approval, or technologies to determine age based on facial structure, gestures, or behaviours - and found all were technically possible.\"But we did not find a single ubiquitous solution that would suit all use cases, nor did we find solutions that were guaranteed to be effective in all deployments,\" it said.Verification using identity documents was cited as the most accurate method, but the report identified concerns that platforms may keep this data longer than required and was anticipating sharing it with regulators, both of which would leave users' privacy at risk.Australia - like much of the world - has in recent years seen a series of high-profile data breaches, including several where sensitive personal information was stolen and sold or published.Facial assessment technology was 92% accurate for people aged 18 or over, but there is a \"buffer zone\" - about two to three years either side of 16 - in which is it is less accurate. The report said this would lead to false positives, clearing children for accounts, and false negatives, barring users who should be allowed.There are also privacy and accuracy concerns with parental approval methods, it said.It recommended that the methods should be \"layered\" to create the most robust system, and highlighted that many of the technology providers were looking at ways to address circumvention, through things like document forgeries and VPNs (virtual private networks) which obscure the user's country.Communications Minister Anika Wells said there was \"no one-size-fits-all solution\", that the report showed age checks could be \"private, efficient and effective\". \"These are some of the world's richest companies. They are at the forefront of AI. They use the data that we give them for a bevy of commercial purposes. I think it is reasonable to ask them to use that same data and tech to keep kids safe online,\" she told reporters on Monday.\"There is no excuse for social media platforms not to have a combination of age assurance methods in their platforms ready for 10 December.\"Under the ban, tech companies can fined up to A$50m ($32.5m; £25.7m) if they do not take \"reasonable steps\" to bar those aged under 16 from holding accounts. These steps are still to be defined.Facebook, Instagram, Snapchat and YouTube are among the platforms affected.Polling indicates most Australian adults support banning social media for children under 16.However some mental health advocates say the policy has the potential to cut kids off from connection, and others say it could push children under 16 to even-less-regulated corners of the internet. They suggest the government should instead focus on better policing of harmful content on social media platforms and preparing children for the reality of life on the web.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:54.582906"
  },
  {
    "url": "https://www.bbc.com/news/articles/cx2pr1wwq44o",
    "heading": "BYD shares slide as China's EV price war hits profits",
    "content": "Shares in Chinese electric vehicle maker BYD slid by as much as 8% on Monday after it reported a drop in profit because of a price war in China's car sector.The carmaker had on Friday reported that its net profit fell to 6.4bn yuan ($900m; £660m) between April and June, down 30% from a year earlier.BYD said in its filing that \"increased price competition\" among China's EV brands had impacted the industry.The Shenzhen-based manufacturer is facing an increasingly crowded market, competing against local rivals Nio and XPeng and US carmaker Tesla, which have all slashed prices to draw buyers.\n\nShares in Chinese electric vehicle maker BYD slid by as much as 8% on Monday after it reported a drop in profit because of a price war in China's car sector.The carmaker had on Friday reported that its net profit fell to 6.4bn yuan ($900m; £660m) between April and June, down 30% from a year earlier.BYD said in its filing that \"increased price competition\" among China's EV brands had impacted the industry.The Shenzhen-based manufacturer is facing an increasingly crowded market, competing against local rivals Nio and XPeng and US carmaker Tesla, which have all slashed prices to draw buyers.\n\nThe carmaker's stock fell at the open in Hong Kong on Monday but recovered slightly throughout the day.Competition in China's car sector has reached a \"fever pitch\", said BYD in its statement.It said \"industry malpractices... [like] excessive marketing\" played a part in disrupting the market.EV makers have subsidised car dealers and offered zero-interest loans to buyers as the industry becomes increasingly cutthroat.It has prompted warnings from Beijing, which urged automakers to stop the aggressive discounts in order to protect the economy.Average car prices in China have fallen by around 19% over the past two years, currently standing at around 165,000 yuan ($23,100; £17,100), according to industry estimates.And despite significant sales abroad, BYD's earnings fell short of analysts' estimates for a modest increase.The company targeted global sales of 5.5 million cars this year, but had sold just 2.49 million by the end of July.BYD's \"surprising\" performance suggests that even the leader of China's EV sector won't necessarily win from a \"cut-throat\" price war, said industrial policy expert Prof Laura Wu from Nanyang Technological University in Singapore.\"[The] drop in stock price trading this morning signals investors' disappointment,\" she said.Beijing's push to end the EV price war is tough, as past policies have led to too many players in the sector, she said.Price cuts may benefit consumers, but they risk creating an oversupply of Chinese EVs in the long run, Prof Wu added.However, BYD's performance should not be seen too negatively, Judith MacKenzie, head of investment firm Downing Fund Managers, told the BBC.\"They've had such a meteoric rise that it's okay to have a bump in the road.\"BYD has grown to become the world's largest EV maker, surpassing Tesla in annual revenue in 2024, thanks to the wide appeal of its hybrid vehicles in China, Asia and European markets.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:55.492997"
  },
  {
    "url": "https://www.bbc.com/news/articles/c0qljy44553o",
    "heading": "Putin says he reached 'understandings' with Trump over end of Ukraine war",
    "content": "Russian President Vladimir Putin says he reached \"understandings\" with US President Donald Trump over the end of the Ukraine war, at their meeting in Alaska last month.But he did not say whether he would agree to peace talks with Ukrainian President Volodymyr Zelensky brokered by Trump, who had apparently given Monday as a deadline for Putin's response.Speaking during a summit in China, Putin continued to defend his decision to invade Ukraine, once again blaming the war on the West.Following the Alaska meeting, US special envoy Steve Witkoff said Putin had agreed to security guarantees for Ukraine as part of a potential future peace deal, though Moscow has yet to confirm this.\n\nRussian President Vladimir Putin says he reached \"understandings\" with US President Donald Trump over the end of the Ukraine war, at their meeting in Alaska last month.But he did not say whether he would agree to peace talks with Ukrainian President Volodymyr Zelensky brokered by Trump, who had apparently given Monday as a deadline for Putin's response.Speaking during a summit in China, Putin continued to defend his decision to invade Ukraine, once again blaming the war on the West.Following the Alaska meeting, US special envoy Steve Witkoff said Putin had agreed to security guarantees for Ukraine as part of a potential future peace deal, though Moscow has yet to confirm this.\n\nPutin was speaking in Tianjin at the Shanghai Cooperation Organisation summit, where he met Xi Jinping and Narendra Modi.He thanked the Chinese and Indian leaders for their support and their efforts to \"facilitate the resolution of the Ukrainian crisis\".China and India are the biggest buyers of Russian crude oil, attracting criticism from the West that they are propping up the Russian economy which has been battered by the war effort.In his speech, Putin also said that the \"understandings reached\" at his meeting with Trump in Alaska are \"I hope, moving in this direction, opening the way to peace in Ukraine\".At the same time, he reiterated his view that \"this crisis wasn't triggered by Russia's attack on Ukraine, but was a result of a coup in Ukraine, which was supported and provoked by the West\".He also attributed the war to \"the West's constant attempts to drag Ukraine into Nato\".The Russian president has consistently opposed the idea of Ukraine joining the Western military alliance.It was in 2014 that Putin seized Crimea and Russian proxies grabbed part of eastern Ukraine. Years later, in February 2022, Putin then ordered Russia's full-scale invasion of Ukraine.Putin's latest comments come days after Russia launched its second biggest aerial attack on Ukraine in the war.On Friday, French President Emmanuel Macron said that Putin faced a Monday deadline set by Trump to agree to peace talks with Zelensky. If the Russian leader does not agree, \"it will show again President Putin has played President Trump\", said Macron.But in an interview with CNN, on 22 August, Trump himself again gave Putin \"a couple of weeks\" to give a response before the US takes action, in the latest of a series of ultimatums and deadlines he has issued to the Russian leader. Trump had previously said he could solve the Ukraine war in one day.Following his meeting with Putin last month, Trump dropped a demand for a ceasefire and called instead for a permanent peace deal.He also met Ukrainian President Volodymyr Zelensky along with top European leaders who paid an urgent visit to Washington DC. Trump insisted there would be \"no going into Nato by Ukraine\" as part of a peace deal.But he also hinted there would be security guarantees, saying Europe was the \"first line of defence\" and that the US would be involved. \"We'll give them good protection,\" he said, though he clarified it would not mean sending US troops to Ukraine.The president's special envoy Steve Witkoff also told CNN that Putin had agreed to security guarantees.He said this would see the US and Europe \"effectively offer Article 5-like language to cover a security guarantee\", referring to the Nato clause which states that member states should defend another member that has come under attack.Zelensky said he expected a framework for security guarantees to be set out on paper as soon as this week.But last Friday Russia criticised Western proposals as \"one-sided and clearly designed to contain Russia\", adding that it turned Kyiv into a \"strategic provocateur\". Russian attacks have also continued. Last Thursday Moscow fired 629 drones and missiles at Kyiv, killing 23 people in one of the biggest aerial assaults of the war so far that prompted outrage from European leaders.Germany and France have since pledged to put pressure on Russia to agree to a deal.Meanwhile, Zelensky has rejected proposals for a buffer zone with Russia as part of a peace deal. He has accused Russia of not being ready for diplomacy and seeking ways to postpone the end of the war.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T16:05:56.661821"
  }
]