[
  {
    "title": "Business",
    "content": "Lower-price goods will no longer be duty-free, in a move that will affect millions of shipments. Critics fear a new law in Texas will prove discriminatory - but officials say it is vital to combat \"adversaries\". Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday. The president has accused Cook of mortgage fraud, and cited constitutional power that he says allows him to fire her. The increase comes after three months in a row of falling sales, according to industry data. Critics fear a new law in Texas will prove discriminatory - but officials say it is vital to combat \"adversaries\". The US scraps its de-minimis exemption, meaning no more duty-free entry of small parcels to the US. Activists in Querétaro criticise state government for prioritising the data processing needs for US tech firms over their own citizens Nvidia remains exposed to geopolitical tensions between the US and China. Gain the leading edge with global insights for the boardroom and beyond, in your inbox every Wednesday. Non-vintage still wine is now increasingly being made in response to more challenging weather. PostNord blames sharply falling demand - will other post firms around the world follow suit? India has banned online betting but the industry says the move will hurt and not help consumers. Parcels from China that are exempt from UK import tax more than doubled in value to £3bn last year. The US president's steep 50% tariffs on India have kicked in, sending Narendra Modi's government into firefighting mode. The iPhone maker is pushing back against proposed changes required by the UK competition watchdog President Trump has suggested this week that wind power is the reason for rising energy bills in the UK. BBC Verify's Ben Chu takes a look at the data. It wants the court to prohibit Ofcom from enforcing the Online Safety Act against it in the US. A personal finance strategy popular among millennials is helping them to quit their job and retire decades early. Five years after being ousted from WeWork, Adam Neumann wants to re-buy the now-bankrupt business. The BBC's Katty Kay has spoken to successful change-makers to ask what made them pivot in their career. Today, the beer industry is male-dominated, but it wasn't always so. Expert advice on how to get through a waiting period. Should there be a cap on billionaires' wealth and their inheritances? A career coach, a choreographer, a chef and a dragon boat captain offer advice on giving critical feedback. Covid-19 reshaped the way we live and work. We rethink solo working and explore the future of work-life. How a new era of quiet, net zero supersonic airliners could revolutionise the aviation industry. Students are graduating in the US this week. The commencement speeches might lead them into questionable choices. These are the long lost words you've been waiting for to describe your colleagues. Veterinarian professionals are committing suicide at a higher rate than the general population. We meet the creators behind the current ASMR boom. Michael O'Leary told the BBC the change would come in November, and that he made no apology for it. The government's stake in the computer chip maker is not without precedent, but it puts Trump at odds with some conservatives. Local media said German lenders had reported millions of suspicious direct debits from the payment firm. The country wants to move from being the biggest exporter of raw nuts to producing more shea butter. It is the latest in a series of chart-topping achievements by the animated musical. Data shows Gen Z are plagued by employment pessimism. BBC Special Correspondent Katty Kay and LinkedIn's Aneesh Raman discuss the difficulty facing entry-level workers. US President Donald Trump was among those criticising the company for unveiling a new, minimalistic version of its logo. Thousands of people reported problems during what was the latest in a long line of banking IT failures. The central bank governor says the US president \"has no authority to do so\" in defiance of Trump's escalatory move against the Fed.",
    "url": "https://www.bbc.com/news/business",
    "scraped_at": "2025-08-29T14:18:10.278414"
  },
  {
    "title": "NewsNews",
    "content": "It is the third protest this week as anger grows over alleged lavish MP allowances, income inequality, and a motorcycle taxi driver's killing. The constitutional court will decide whether to remove the PM - a move that could end the country’s most prominent political dynasty. The high commissioner posts were vacant for 10 months, as both countries expelled each other’s top diplomats. Lawyers for Dr Susan Monarez say only the president can remove her from her job running the US Centers for Disease Control and Prevention. There is frenzy, fascination and even a little bit of FOMO as Koreans revel in the K-pop hit. The constitutional court will decide whether to remove the PM - a move that could end the country’s most prominent political dynasty. Rohingya refugees tell the BBC they were flown from Delhi and forced into the sea off the coast of Myanmar. The two children killed in the shooting have been identified as Fletcher Merkel, eight, and Harper Moyski, 10. Police believe the CCTV footage shows Tom Phillips and his child breaking into a store. The high commissioner posts were vacant for 10 months, as both countries expelled each other’s top diplomats. The leaders of North Korea and Russia will attend China's military parade next week - a win for Xi. Netflix’s Jay Kelly sees the actor portray an ageing movie star, drawing parallels with his own life. The deadly fire was called a \"wake-up call\" but residents are waiting for permanent homes. How much attention did you pay to what happened in the world over the past seven days? In the deadliest strike, a missile ripped through the middle of a low-rise block of flats. Netflix’s Jay Kelly sees the actor portray an ageing movie star, drawing parallels with his own life. Fletcher Merkel, 8, was one of two children killed in Wednesday's shooting at Annunciation Catholic School in Minneapolis. Tokyo authorities say they released the AI-generated video to raise awareness and help people prepare for disaster - but how likely is Mt Fuji to actually erupt? The deadly fire was called a \"wake-up call\" but residents are waiting for permanent homes. A rise in popularity of vapes laced with etomidate, an anaesthetic drug, has caused widespread alarm. The high commissioner posts were vacant for 10 months, as both countries expelled each other’s top diplomats. Investigations have been launched following the footage posted to Instagram - which has since been deleted. One young boy says he was protected from gunfire in a church by a friend who lay on top of him and was shot. The Israeli military declined to comment on reports of the strikes, which Syria condemned. The high commissioner posts were vacant for 10 months, as both countries expelled each other’s top diplomats. The officers had been found guilty of witness tampering in the fatal 2023 beating Jose Mourinho leaves his position as Fenerbahce boss after just over one year in charge of the Turkish club. Investigations have been launched following the footage posted to Instagram - which has since been deleted. Jose Mourinho leaves his position as Fenerbahce boss after just over one year in charge of the Turkish club. Naomi Osaka says Jelena Ostapenko's comments to Taylor Townsend about her having \"no class\" and \"no education\" was \"one of the worst things you could say to a black tennis player\". Coco Gauff credits superstar gymnast Simone Biles for helping bring a \"bit of calm\" as she finds a way to reach the US Open third round. Manchester United reject a request by midfielder Kobbie Mainoo to leave the club on loan - how has it come to this? BBC Sport football expert Chris Sutton takes on The Cut star Orlando Bloom with his predictions for this weekend's Premier League fixtures. Naomi Osaka says Jelena Ostapenko's comments to Taylor Townsend about her having \"no class\" and \"no education\" was \"one of the worst things you could say to a black tennis player\". Tottenham are on the verge of signing RB Leipzig and Netherlands attacker Xavi Simons for £51.8m. All the latest Premier League news conferences and build-up, plus transfer updates. Coco Gauff credits superstar gymnast Simone Biles for helping bring a \"bit of calm\" as she finds a way to reach the US Open third round.",
    "url": "https://www.bbc.com/news/",
    "scraped_at": "2025-08-29T14:18:10.703428"
  }
]