[
  {
    "url": "https://www.bbc.com/news/articles/cy9834jp9qno",
    "heading": "Kyiv in mourning after strikes as allies discuss military support",
    "content": "A day of mourning has been declared in Kyiv after the second biggest aerial attack of the war so far killed at least 23 people, including four children. The city's mayor, Vitali Klitschko, said it was to honour the dead, as a massive recovery effort continues at the five-storey block of flats where 22 of the 23 were killed. The attack has been widely condemned - the White House said President Donald Trump was \"not happy\" but not surprised, while European Union Commission President Ursula von der Leyen said Russia would \"stop at nothing to terrorise Ukraine\". Meanwhile, EU defence ministers are meeting in Copenhagen, Denmark, on Friday to discuss military support for Ukraine. The attack also damaged the EU's diplomatic mission and the British Council building in central Kyiv. Speaking on the way into Friday's meeting, Lithuania's Defence Minister Dovilė Šakalienė said Russian President Vladimir Putin was \"cheaply buying time to kill more people\". \"Hopes of possible peace negotiations are at least naïve when we look at what is happening in Ukraine and what just happened [on Thursday],\" she added. Estonia's Defence Minister Hanno Pevkur said the best security guarantee for Ukraine would be membership of Nato. Overnight from Thursday into Friday saw less fighting, although both Russia and Ukraine reported shooting down dozens of drones. Kharkiv regional head Oleh Syniehubov said five settlements in his region had been attacked, with one person being killed in Kupyansk. Trump had hoped to organise a summit involving Ukrainian President Volodymyr Zelensky and Putin to bring an end to the war, but those efforts have since stalled. Speaking after Thursday's attack, Zelensky said Moscow had chosen \"ballistics instead of the negotiating table\", and reiterated the need for \"new, tough sanctions\" on Russia. Speaking after a meeting with French President Emmanuel Macron on Thursday, German Chancellor Friedrich Merz said it seemed unlikely now that a meeting between Putin and Zelensky would take place.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:09.493285"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4g0p0522zeo",
    "heading": "'India put us on the boat like captives - then threw us in the sea'",
    "content": "Noorul Amin last spoke to his brother on 9 May. The call was brief, but the news was devastating. He learned that his brother, Kairul, and four other relatives were among 40 Rohingya refugees allegedly deported by the Indian government to Myanmar, a country they had fled in fear years ago. Myanmar is in the midst of a brutal civil war between the junta - which seized power in a 2021 coup - and ethnic militias and resistance forces. The odds that Mr Amin will ever see his family again are vanishingly small. \"I could not process the torment that my parents and the others who were taken are facing,\" Mr Amin, 24, told the BBC in Delhi. Three months after they were removed from India's capital, the BBC managed to contact the refugees in Myanmar. Most are staying with the Ba Htoo Army (BHA), a resistance group fighting the military in the south-west of the country. \"We don't feel secure in Myanmar. This place is a complete war zone,\" said Soyed Noor on a video call made from the phone of a BHA member. He spoke from a wooden shelter with six other refugees around him. The BBC gathered testimonies from the refugees and accounts from relatives in Delhi and spoke to experts investigating the allegations to piece together what happened to them. We have learnt that they were flown from Delhi to an island in the Bay of Bengal, put on a naval vessel and eventually forced into the Andaman Sea with life jackets. They then made their way to shore and are now facing an uncertain future in Myanmar, which the mostly-Muslim Rohingya community had fled in huge numbers in recent years to escape persecution. \"They bound our hands, covered our faces and brought us like captives [on to the boat]. Then they threw us in the sea,\" John, one of the men in the group, told his brother by phone soon after reaching land. \"How can someone just throw human beings into the sea?\" asked Mr Amin. \"There is humanity alive in the world but I have not seen any humanity in the Indian government.\" Thomas Andrews, the UN's special rapporteur on the situation of human rights in Myanmar, says there is \"significant evidence\" proving these allegations, which he has presented to India's head of mission in Geneva but has yet to receive a response. The BBC has also contacted India's Ministry of External Affairs several times but had not heard back by time of publication. Campaigners have often flagged that the condition of Rohingya in India is precarious. India does not recognise the Rohingya as refugees but rather, as illegal immigrants under the country's Foreigners Act. India has a sizeable population of Rohingya refugees, although Bangladesh, where more than a million live, has the biggest number. Most fled Myanmar after a deadly army crackdown in 2017. Despite having lived there for generations, Rohingya are not recognised in Myanmar as citizens. There are 23,800 Rohingya refugees in India registered with the UNHCR, the UN's refugee agency. But Human Rights Watch estimates that the actual number is upwards of 40,000. On 6 May the 40 Rohingya refugees, who had UNHCR refugee cards and lived in different parts of Delhi, were taken to their local police stations under the guise of collecting biometric data. This is a yearly process mandated by the Indian government where Rohingya refugees are photographed and fingerprinted. After several hours they were taken to the Inderlok Detention Centre in the city, they told the BBC. Mr Amin says his brother called him then and told him he was being taken to Myanmar, and asked him to get a lawyer and alert the UNHCR. On 7 May, the refugees said they were taken to Hindon airport, just east of Delhi, where they boarded planes to the Andaman and Nicobar Islands, an Indian territory in the Bay of Bengal. \"After getting off the plane, we saw that two buses had come to receive us,\" said Mr Noor on the video call. He added he could see the words \"Bhartiya Nausena\" written on the side of the buses, the Hindi term referring to the Indian Navy. \"As soon as we got to the bus, they bound our hands with some plastic material and covered our face with a black muslin cloth,\" he said. Although the people on the buses did not identify themselves, they were dressed in military fatigues and were speaking Hindi. After a short bus ride, the group boarded a naval vessel in the Bay of Bengal, which Mr Noor said they only realised later once their hands had been untied and their faces uncovered. They describe the vessel as a large warship with two floors, at least 150m (490 feet) in length. \"Many of [the people on the ship] were wearing T-shirts, black-coloured trousers and black army boots,\" said Mohammad Sajjad, who was on the call with Mr Noor. \"They weren't all wearing the same thing - some in black, some in brown.\" Mr Noor says that the group was on the naval vessel for 14 hours. They were given meals regularly, traditional Indian fare of rice, lentils and paneer (cheese). Some of the men say they were subjected to violence and humiliation on the ship. \"We were treated very badly,\" said Mr Noor. \"Some were beaten very badly. They were slapped multiple times.\" On the video call, Foyaz Ullah showed the scars on his right wrist, and described repeatedly being punched and slapped on his back and face, and poked with a bamboo rod. \"They asked me why I was in India illegally, why are you here?\" The Rohingya are a predominantly Muslim ethnic community but of the 40 people forcibly returned in May, 15 are Christian. Those detaining them on their journey from Delhi would even say, \"'why didn't you become Hindu? Why did you convert from Islam to Christianity?',\" said Mr Noor. \"They even made us pull down our pants to see if we are circumcised or not.\" Another refugee, Eman Hussain, said the military personnel accused him of being involved in the Pahalgam massacre, referring to a 22 April attack where 26 civilians, mostly Hindu tourists, were shot dead by militants in Indian-administered Kashmir. The Indian government has repeatedly accused Pakistani nationals of carrying out  the attacks, a claim Islamabad denies. There's been no suggestion that Rohingya had any link to the shootings. The next day, on 8 May, at about 19:00 local time (12:30 GMT), the refugees were told to climb down a ladder on the side of the naval vessel. Below, they described seeing four smaller rescue boats, black and made of rubber. The refugees were made to board two of the boats, 20 on each and accompanied by several of the people transporting them. The two other boats, which led the way, had more than a dozen personnel on them. For more than seven hours, they travelled with their hands tied. \"One of the boats with the military personnel reached the seashore and tied a long rope to a tree. That rope was then brought to the boats,\" Mr Noor said. He said they were given life jackets, their hands were untied - and they were told to jump into the water. \"We held on to the rope and swam more than 100m to get to the shore,\" he said, adding that they were told that they had reached Indonesia. Then the people who'd taken them there left. The BBC put these allegations to the Indian government and the Indian Navy, and have not received a response. In the early hours of 9 May, the group was found by local fishermen who told them they were in Myanmar. They let the refugees use their phones to call their relatives in India. For more than three months, the BHA has been assisting the stranded refugees by providing food and shelter, in the Tanintharyi region of Myanmar. But their families in India are terrified about their fate in Myanmar. The UN says the lives of Rohingya refugees \"were put at extreme risk when Indian authorities forced [them] into the Andaman Sea\". \"I've been personally researching this very disturbing case,\" said Mr Andrews. He admitted the amount of information he could share was limited, but that he had also \"spoken with eyewitnesses and been able to corroborate those reports and establish that they are based in fact\". On 17 May, Mr Amin and another family member of the refugees who were removed filed a petition urging India's Supreme Court to bring them back to Delhi, immediately stop similar deportations and offer compensation to all 40 individuals. \"It opened up the country to the awfulness of the Rohingya deportation,\" says Colin Gonsalves, a senior advocate in the Supreme Court who is arguing on behalf of the petitioners. \"That you can drop a person in the sea with a life jacket in a war zone was something people automatically chose to disbelieve,\" Mr Gonsalves said. In response to the petition, one Supreme Court judge on the two-judge bench called the allegations \"fanciful ideas\". He also said the prosecution had not provided enough evidence to substantiate their claims. Since then, the court has agreed to hear arguments on 29 September to decide whether the Rohingya can be treated as refugees or if they are illegal immigrants and therefore subject to deportations. Considering that tens of thousands of Rohingya refugees are living in India, it's not clear why so much effort was devoted to deporting these 40 people. \"Nobody in India can understand why they did it, apart from this venom against Muslims,\" said Mr Gonsalves. The treatment of the refugees has sent a chill throughout the Rohingya community in India. In the past year, its members claim there has been an increase in deportations by the Indian authorities. There are no official figures to confirm this. Some have gone into hiding. Others like Mr Amin no longer sleep at home. He has sent his wife and three children elsewhere. \"In my heart there is only this fear that the Indian government will take us also and throw us in the sea anytime. And now we are scared to even step out of our homes,\" Mr Amin said. \"These are people who are in India not because they want to be,\" said Mr Andrews from the UN. \"They're there because of the horrific violence that is occurring in Myanmar. They literally have been running for their lives.\" Additional reporting by Charlotte Scarr in Delhi",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:10.877486"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4g0lyny7ydo",
    "heading": "Minneapolis school attacker 'obsessed with idea of killing children', officials say",
    "content": "Investigators say that the attacker who opened fire on pupils as they were praying at a church in Minneapolis was \"obsessed with the idea of killing children\". Robin Westman, who killed two children and injured 18 others, did not seem to have any specific motive, according to Minneapolis Police Chief Brian O'Hara. The attacker \"appeared to hate all of us\", the chief said on Thursday, adding: \"More than anything, the shooter wanted to kill children\". The murdered children have been identified by family as Fletcher Merkel, eight, and Harper Moyski, 10. \"Yesterday, a coward decided to take our eight-year-old son Fletcher away from us,\" his father, Jesse Merkel, told reporters. \"Fletcher loved his family, friends, fishing, cooking and any sport that he was allowed to play,\" he said. \"Give your kids an extra hug and kiss today. We love you, Fletcher. You'll always be with us,\" he continued, choking back tears. The parents of Harper Moyski, Michael Moyski and Jackie Flavin, said in a statement that their daughter \"was a bright, joyful, and deeply loved 10-year-old whose laughter, kindness, and spirit touched everyone who knew her\". \"As a family, we are shattered, and words cannot capture the depth of our pain,\" they said, adding that they hope \"her memory fuels action\" to stop gun violence. \"No family should ever have to endure this kind of pain.... Change is possible, and it is necessary - so that Harper's story does not become yet another in a long line of tragedies.\" Officials have released few details so far about the suspect's background, but say Westman previously attended the church's school and had a mother who had worked there. The 23-year-old suspect is believed to have approached the side of the Annunciation Church, which also houses a school, and fired dozens of shots through the windows using three firearms. Police also found a smoke bomb at the scene. Witnesses have described seeing children bleeding as they fled from the church, begging for help from strangers. In a news conference on Thursday, acting US Attorney General for Minnesota Joseph Thompson said \"the shooter expressed hate towards many groups, including the Jewish community and towards President Trump\". The attacker, who died at the scene of a self-inflicted gunshot wound, left a note, officials said, but they added that a definitive motive may never be known. \"I won't dignify the attacker's words by repeating them, they are horrific and vile,\" said Mr Thompson. Westman's name was legally changed from Robert to Robin in 2020, with the judge writing: \"Minor child identifies as a female\". However, some federal officials and police have referred to Westman as a man when discussing the attack. Chief O'Hara told reporters that news outlets should stop using the killer's name, because \"the purpose of the shooter's actions was to obtain notoriety\". He added that she, \"like so many other mass shooters that we have seen in this country too often and around the world, had some deranged fascination with previous mass shootings\". US officials have warned for years that mass shooting can lead to copycat killings, as killers seek to become famous through their heinous crimes. Several major news organisations have a policy of not identifying mass killers. FBI Director Kash Patel has described the attack as \"an act of domestic terrorism motivated by a hate-filled ideology\". In a post on X, Patel said that the attacker \"left multiple anti-Catholic, anti-religious references\" written on guns and in notes uncovered by investigators. \"Subject expressed hatred and violence toward Jewish people, writing Israel must fall,' 'Free Palestine,' and using explicit language related to the Holocaust,\" he wrote. The killer also \"wrote an explicit call for violence against President Trump on a firearm magazine\". In their news conference, officials confirmed that the attacker had previously attended the school. Her mother, Mary Grace Westman, previously worked at the school, and has so far not responded to law enforcement's attempts to contact her. They also confirmed that three residences associated with the attacker, who was from suburban Minneapolis, have been searched by police. They said that the church locked its doors before beginning its Mass service, likely saving many lives. Officials added that the guns used in the attack were all legally purchased, that the killer did not appear on any government watchlist, and that police are not aware of any mental health diagnoses or treatments that she was receiving. Witnesses and relatives of victims who spoke to the BBC have described harrowing scenes of violence. Patrick Scallen, who lives near the church, said that he saw three children fleeing the building - one of them a girl with a head wound. \"She kept saying, 'please hold my hand, don't leave me', and I said I wasn't going anywhere.\" Vincent Francoual, whose 11-year-old daughter Chloe was in the church when the shooting took place, said he tried not to panic after he heard the news. He called it \"sick\" that children in the US are trained to prepare for mass shootings. \"We live in a country where we train kids what to do. And she did what she had to do,\" he said. \"Here it's a pattern. It's no longer a freak accident,\" he said of school shootings in the US. \"I told my wife that every morning, when we drop our kids, we don't know if she'd be back safe.\" Mr Francoual, who is originally from France, said that Chloe is afraid to return to school or church. In the wake of the attack, several lawmakers, including the Minneapolis mayor, have called for the state to enact a ban on assault weapons. \"There is no reason that someone should be able to reel off 30 shots before they even have to reload,\" said Mayor Jacob Frey, also calling for a ban on high-capacity ammo magazines. \"We're not talking about your father's hunting rifle here. We're talking about guns that are built to pierce armour and kill people.\"",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:12.482105"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4gj5gl6e94o",
    "heading": "India and Canada name top diplomats after 10 months to mend ties",
    "content": "India and Canada have appointed new high commissioners to each other's countries, in the latest step to restore ties strained by the killing of a Sikh separatist leader in a Vancouver suburb in 2023. India's previous high commissioner left Canada last October after Ottawa expelled him, linking six diplomats to the murder of Hardeep Singh Nijjar - though Delhi insisted he was withdrawn. That same day, India ordered out six senior Canadian diplomats, including the acting high commissioner. The mutual expulsion of top diplomats last year marked an unprecedented low in an otherwise cordial relationship. Nijjar, designated a terrorist by India in 2020, was shot dead by two gunmen outside a Sikh temple in Vancouver in June 2023. Relations between the two countries deteriorated months later after former prime minister Justin Trudeau alleged \"credible allegations\" linking Indian government agents to Nijjar's killing. India called the accusations \"absurd and motivated\" and accused Canada of providing shelter to Sikh separatists. At their first meeting in Canada in June, PM Modi and Trudeau's successor Mark Carney agreed to reinstate senior diplomats, a sign of thaw in relations. Ottawa has now named Christopher Cooter as its new envoy to Delhi, while India has appointed Dinesh K Patnaik, currently ambassador to Spain, as its representative in Canada. Canada's Foreign Minister Anita Anand said the appointment of Mr Cooter was part of a \"step-by-step approach to deepening diplomatic engagement\" with India. India's foreign ministry said Mr Patnaik was \"expected to take up the assignment shortly\". India has sharply criticised Canada for tolerating the pro-Khalistan movement, saying Ottawa has long been aware of and monitoring such groups. The Khalistan movement calls for an independent homeland for Sikhs in India. There are some 770,000 Sikhs living in Canada, home to the largest Sikh diaspora outside the Indian state of Punjab. Follow BBC News India on Instagram, YouTube, Twitter and Facebook.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:14.138142"
  },
  {
    "url": "https://www.bbc.com/news/articles/czxpzl12pqeo",
    "heading": "India's International Booker Prize winner at the centre of a political row",
    "content": "International Booker Prize winning-author Banu Mushtaq has found herself in the midst of a controversy after she was invited to inaugurate a prominent festival in the southern Indian state of Karnataka. Last week, the state's Congress government announced that Mushtaq - who won the Prize earlier this year for her short story anthology, Heart Lamp - would inaugurate the Mysuru Dasara festivities in Mysuru (formerly called Mysore). Mysuru Dasara, also called Naada Habba (which roughly translates to festival of the land in Kannada), is an annual 10-day event that has been celebrated for decades. Thousands of people flock to the city to participate in the grand festivities, which include cultural performances, elephant parades, exhibitions and fireworks. The decision to invite Mushtaq sparked criticism from some Bharatiya Janata Party (BJP) leaders - which is in the opposition in the state - who said that Mushtaq, a Karnataka-born Muslim, should not be inaugurating a Hindu festival. Dussehra is a Hindu festival which celebrates the victory of good over evil, but Mysuru Dasara is conducted by the Karnataka state government and people of all faiths join in the celebrations. Mushtaq has said that she was honoured to be invited to the festival and that she felt deeply connected to it, having participated in the festivities herself as a child. But despite her expressing respect for the festival, the controversy has refused to die down. Some BJP leaders have also taken offence to some of Banu's previous comments related to the Hindu goddess Bhuvaneshwari, who is considered to represent Kannada language and identity. Mushtaq made history earlier this year when she became the first author writing in the Kannada language to win an International Booker. Her award winning-book, Heart Lamp, which was translated into English by Deepa Bhasthi, was praised by judges for showcasing characters that were \"astonishing portraits of survival and resilience\". Mushtaq's stories, including in Heart Lamp, focus on the challenges women, especially Muslim women, face due to religious conservatism and a deeply patriarchal society. Interestingly, she isn't the first Muslim person to be invited to inaugurate the Mysuru Dasara festival. In 2017, KS Nisar Ahmed, a Kannada poet and author, had been given the honour. But the invitation to Mushtaq has come under scrutiny from the BJP. BJP MP Yaduveer Wadiyar acknowledged Mushtaq's influence on Kannada writing, saying that her Booker win brought \"great pride\" to the Kannada literary fraternity. However, he added that the Mysuru Dasara festival wasn't a cultural event but a Hindu religious festival and demanded that Mushtaq \"clarify her reverence\" towards the two Hindu dieties associated with the festival before agreeing to inaugurate it. BJP leader Pratap Simha said that while it was okay for Mushtaq to chair literary festivals, it wasn't acceptable for her to be the chief guest at an event like Mysuru Dasara. He also questioned if Mushtaq had faith in the festival's  goddesses and if she followed Hindu traditions. Amid the criticism, a video of a speech delivered by Mushtaq last January began circulating online. In her speech, she questioned the practice of associating a Hindu deity (Bhuvaneshwari) with Kannada language and identity, pointing out that it was exclusionary to her and other Muslims in the state. Mushtaq isn't the first author to view this blurring of identities through a critical lens. Many progressive writers from the state have criticised what they call a \"Hinduisation\" of the Kannada language and identity. Supporters of the invitation to Mushtaq say that the row is not just about her religious identity, but that it is a larger battle between keeping one of the state's biggest festivals open and welcoming to all faiths and turning it into a majoritarian event. \"Mysuru Dasara is a secular festival and inviting Banu to inaugurate it is one of the best things that can happen to Karnataka. Turning this into an issue about religion or Hindutva [Hindu nationalist agenda] is detestable,\" says Mamta Sagar, a Kannada poet. Meanwhile, Karnataka's Deputy Chief Minister DK Shivakumar has defended his government's decision to invite Mushtaq, highlighting the festival's inclusive character. Mushtaq too hasn't bowed down to pressure to decline the invite. \"Active politicians should have a sense of what to politicise and what not to,\" she told The Hindu newspaper.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:15.768817"
  },
  {
    "url": "https://www.bbc.com/news/articles/cwy3zjxy3dwo",
    "heading": "White House names RFK Jr deputy as replacement CDC director",
    "content": "The White House has named a replacement for the director of the US Centres for Disease Control and Prevention (CDC), a day after its previous leader was forced out of the job. Jim O'Neill currently serves as the deputy to Health Secretary Robert F Kennedy Jr, and will replace Susan Monarez after she was in the role for just a month. Lawyers representing Dr Monarez said her sacking was illegal, and alleged she was targeted by Kennedy because she refused \"to rubber-stamp unscientific, reckless directives\". The reason for her removal was that she was \"not aligned with the president's agenda\", the White House said in a statement. O'Neill is a former Silicon Valley tech investor and takes over the CDC at a time when some of its leading officials are deeply divided over vaccine policies. At least three senior CDC leaders have since resigned from the agency, some citing frustration over vaccine policy and the leadership of Kennedy, also known as RFK Jr. Among them was Chief Medical Officer Debra Houry, who warned about the \"rise of misinformation\" about vaccines in a letter seen by the BBC's US partner CBS News. She also argued against planned cuts to the agency's budget. A long-time federal government scientist, Dr Monarez was nominated by President Donald Trump to lead the CDC and was confirmed in a Senate vote along party lines in July. Her nomination followed Trump withdrawing his first pick, former Republican Congressman Dave Weldon, who had come under fire for his views on vaccines and autism. On Wednesday, Dr Monarez's lawyers issued a statement saying that she had chosen \"protecting the public over serving a political agenda\". The White House statement announcing the termination of her post said: \"As her attorney's statement makes abundantly clear, Susan Monarez is not aligned with the president's agenda.\" On Thursday, Kennedy told Fox & Friends on Fox News that the CDC leadership \"needs to execute Trump's agenda\". The CDC, he added, \"is in trouble, needs to be fixed\". The New York Times reports that she was at odds with Kennedy, a vaccine sceptic, over vaccine policy. The White House has said they will name her replacement shortly. \"If people are not aligned with the President's vision and the Secretary's vision to make this country healthy again, then we will gladly show them the door,\" White House Press Secretary Karoline Leavitt said on Thursday about the multiple exits. The exodus at the top of one of the world's most foremost public health bodies comes as health experts voice concern over the agency's approach to immunisations since Kennedy took over. Senator Bernie Sanders, who is the ranking member of the Senate Health, Education, Labor and Pensions (HELP) said the sacking was \"reckless\" and \"dangerous\" and called for an investigation into the firing of Dr Monarez. Daniel Jernigan, who led the National Center for Emerging and Zoonotic Infectious Diseases, was one of those to quit citing \"the current context in the department\". Head of the National Center for Immunization and Respiratory Diseases, Demetre Daskalakis, also said he was no longer able to serve \"because of the ongoing weaponising of public health\". There are also reports, including by NBC News, that Dr Jennifer Layden, director of the Office of Public Health Data, Surveillance and Technology, has also resigned. Earlier on Wednesday, the Food and Drug Administration (FDA) approved new Covid vaccines while limiting who could receive them. The vaccines will be available for all seniors, but younger adults and children without underlying health conditions will be excluded. \"The emergency use authorizations for Covid vaccines, once used to justify broad mandates on the general public during the Biden administration, are now rescinded,\" Kennedy wrote on X. Dr Monarez was the first CDC director in 50 years to not hold a medical degree. Her background is in infectious disease research. In her month as the CDC leader, she helped comfort agency employees after the CDC's headquarters in Atlanta was attacked by a gunman who believed he had been harmed by Covid vaccines. The attack, in which hundreds of bullets struck the building, killed one police officer. Earlier this month, current and former employees of the agency wrote an open letter accusing Kennedy of fuelling violence towards healthcare workers with his anti-vaccine rhetoric. Dr Monarez's departure comes about a week after a union representing CDC employees announced that about 600 CDC employees had been fired. The wide-ranging layoffs included employees working on the government's response to infectious diseases, including bird flu, as well as those researching environmental hazards and handling public record requests.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:17.153378"
  },
  {
    "url": "https://www.bbc.com/news/articles/c5y0ey8qvw9o",
    "heading": "Famous croc wrangler found guilty in evidence tampering trial",
    "content": "Famed Australian crocodile wrangler Matt Wright has been found guilty of lying to police and pressuring a hospitalised witness after a fatal helicopter crash. The former Netflix star was charged with three counts of perverting the course of justice over the crocodile egg harvesting disaster in 2022. A jury on Friday returned guilty verdicts for two but could not agree on the third. Wright's friend and Outback Wrangler co-star Chris \"Willow\" Wilson, who was suspended from the aircraft in a sling, died when it hit the ground. Pilot Sebastian Robinson was also seriously injured. Prosecutors argued Wright had tried to tamper with evidence out of fear of being blamed for the crash. Wright had pleaded not guilty to the charges, and his lawyers have already flagged they intend to appeal the verdict - which was delivered by the jury on his 46th birthday. Walking out of the courthouse on Friday, Wright told reporters that he was \"pretty disappointed in the verdict\" but would \"keep moving forward with this\". \"It's been devastating for everyone involved,\" he added. While Wright was not on board during the crash, he was among the first on the scene in Arnhem Land, about 500km (310 miles) east of Darwin. The Air Transport Safety Bureau found that the helicopter's engine had stopped mid-flight because it had run out of fuel. The helicopter was \"likely not refuelled at a fuel depot\" during the journey to harvest crocodile eggs, and \"the pilot did not identify the reducing fuel state\", investigators said. Wright was convicted on Friday of lying to investigators about how much fuel was in the machine, as well as asking Mr Robinson, the injured pilot, to falsify flight records. Prosecutors alleged that Wright had been disconnecting his helicopters' flying-hour meters so that their long flight times - which exceeded official standards - could go undetected, and he was worried that he would be found out. The third count, which the Supreme Court jury in Darwin failed to agree on, involves an allegation that Wright told an associate to \"just torch\" the helicopter's records. Wright was released on bail on Friday. While prosecutors sought custody for him, citing the seriousness of his offences, the judge granted Wright bail on the grounds that it was \"extremely unlikely there will not be an appeal\" of the verdict. Wright is best known globally as the star of National Geographic's Outback Wrangler and Netflix's Wild Croc Territory reality shows. He also owns several local tourism businesses and has been a tourism ambassador for Australia.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:19.033777"
  },
  {
    "url": "https://www.bbc.com/news/articles/cdrkvy2pn87o",
    "heading": "How a leaked phone call derailed the Thai PM's career - and the Shinawatra dynasty",
    "content": "Thailand's Constitutional Court strikes again, removing yet another prime minister from office. The country's notoriously interventionist panel of nine appointed judges has ruled that Paetongtarn Shinawatra  violated ethical standards in a phone call she had in June with the veteran Cambodian leader Hun Sen, which he then leaked. In it, Paetongtarn could be heard being conciliatory towards Hun Sen over their countries' border dispute, and criticising one of her own army commanders. She defended her conversation saying she had been trying to make a diplomatic breakthrough with Hun Sen, an old friend of her father Thaksin Shinawatra, and said the conversation should have remained confidential. The leak was damaging and deeply embarrassing for her and her Pheu Thai party. It sparked calls for her to resign as her biggest coalition partner walked out of the government, leaving her with a slim majority. In July, seven out of the nine judges on the court voted to suspend Paetongtarn, a margin which suggested she would suffer the same fate as her four predecessors. So Friday's decision was not a surprise. Paetongtarn is the fifth Thai prime minister to be removed from office by this court, all of them from administrations backed by her father. This has given rise to a widespread belief in Thailand that it nearly always rules against those seen as a threat by conservative, royalist forces. The court has also banned 112 political parties, many of them small, but including two previous incarnations of Thaksin's Pheu Thai party, and Move Forward, the reformist movement which won the last election in 2023. In few other countries is political life so rigorously policed by a branch of the judiciary. In this case, it was the leaked phone conversation that sealed Pateongtarn's fate. It is not clear why Hun Sen chose to burn his friendship with the Shinawatra family. He reacted angrily to a comment by Paetongtarn calling the Cambodian leadership's use of social media to push its arguments \"unprofessional\". Hun Sen described it as \"an unprecedented insult\", which had driven him to \"expose the truth\". But his decision caused a political crisis in Thailand, inflaming tensions over their border, which last month erupted into a five-day war that killed more than 40 people. The Thai constitution now requires members of parliament to choose a new prime minister from a very limited list. Each party was required to name three candidates before the last election, and Pheu Thai has now used up two, after the court's dismissal of Srettha Thavisin last year. Their third candidate, Chaikasem Nitisiri, is a former minister and party stalwart, but has little public profile and is in poor health. The alternative would be Anutin Charnvirakul, the former interior minister whose Bhumjaithai party walked out of the ruling coalition, ostensibly over the leaked phone call. Relations between the two parties are now strained, and Anutin would have to rely on Pheu Thai, which has many more seats, to form a government, which is hardly a recipe for stability. The largest party in parliament, the 143 MPs who were formerly in the now-dissolved Move Forward and have reformed as The People's Party, has vowed not to join any coalition, but to remain in opposition until a new election is held. A new election would appear to be the obvious way out of the current political mess, but Pheu Thai does not want that. After two years in office it has been unable to meet its promises to revive the economy. For all of her youth, the inexperienced Paetongtarn failed to establish any real authority over the country, with most Thais presuming that her father was making all the big decisions. But Thaksin Shinawatra seems to have lost his magic touch. Pheu Thai party's signature policy at the last election, a digital wallet which would put B10,000 ($308; £178) in the pocket of every Thai adult, has stalled, and been widely criticised as ineffective. Other grand plans, to legalise casinos, and to build a \"land-bridge\" linking the Indian and Pacific Oceans, have gone nowhere. At a time when Thai nationalist sentiment has been fired up over the border war with Cambodia, the Shinawatra family's long-standing – though now broken – friendship with Hun Sen has heightened suspicion in conservative circles that they will always put their business interests before those of the nation. The party's popularity has plunged, and it is likely it would lose many of its 140 seats in an election now. For more than two decades it was an unbeatable electoral force which dominated Thai politics. It is hard to see how it will ever regain that dominance.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:20.484824"
  },
  {
    "url": "https://www.bbc.com/news/articles/cz0yzxx3x08o",
    "heading": "'The details were almost perfect': Kpop Demon Hunters sparks pride in Korea",
    "content": "When a South Korean monk performed a Buddhist ritual for a wildly popular K-pop boy band, it was the most unusual ceremony he had ever held. His mission: to guide the souls of the band to peace and rebirth. The band were long gone - or rather, they had never been alive, except in the fictional world of the animated Netflix hit Kpop Demon Hunters. Still, the YouTube video went viral. Although cast as villains, the Saja Boys have won a devoted following for their gorgeous looks and swagger. Even their name - saja - translates to \"angel of death\", among other things. The live-streamed service, a genuine Buddhist rite known as Chondojae usually performed by monks for grieving families, lasted more than two hours and drew more than 4,000 viewers - more people than he had ever seen for a ceremony, even offline, says the monk, a virtual YouTuber who prefers to remain anonymous. This was no joke. The BBC confirmed that he is a registered monk. But he could not guarantee salvation for the Saja Boys, not even for the lead, Jinu. \"That would depend on his good karma. I can guide him, but I can't promise.\" As K-pop Demon Hunters tops every chart - Netflix says it has become its most watched movie ever - Koreans are revelling in the moment. Made and voiced by Korean-Americans, developed by Sony and released by Netflix, the film's inspiration is deeply Korean. It's a tale about mythical demon hunters whose power comes from their music - in this case, that's a sassy K-pop girl band called Huntrix. And of course, the soundtrack that fans across the world are now singing along to every day is rooted in South Korea's biggest export: K-pop. All of this has sparked a frenzy in South Korea, like in so many other places, a fascination with the Korean culture the movie centres, and even a little bit of FOMO - because unlike in the US and Canada, there are no plans yet to release the movie in cinemas here. \"Seeing all the sing-along clips [online] at cinemas… I'm jealous of Americans!\" wrote a fan on social media. Another vowed, \"I'll even take a day off if KDH comes to cinemas\" - a big promise in South Korea's gruelling work culture. Part of the fandom is driven by respect. Many Koreans are wary of clumsy depictions of their country on screen, especially given how  popular the culture is right now. And to have such a global hit get it wrong would have stung. \"I've seen plenty of films and dramas that touched on Korean culture, but they were always full of errors. They would confuse it with Chinese or Japanese traditions, show actors speaking awkward Korean, and reduce everything to a shallow imitation,\" says Lee Yu-min, a woman in her 30s. \"But I was genuinely astonished at KDH's portrayal of our culture.\" Pointing to the opening scene, she says: \"A thatched-roof house from the Joseon Dynasty, ordinary people in hanbok [traditional Korean clothing] with their distinct hairstyles – the details were almost perfect.\" She says she had \"never imagined\" that it would capture hearts across the world the way it has. Songs from the movie have become some of the most streamed on Spotify, while the track Golden hit number one on the Billboard Hot 100. The fandom in South Korea is no less. Surprisingly, one of the biggest beneficiaries has been the National Museum of Korea, which carries traditional Korean artefacts that are featured in the film. Already the most visited museum in Asia, it now has queues stretching outside before the doors even open, as Koreans line up to look at exhibits and shop for merchandise at the gift store. It recorded more than 740,000 visitors in July, over twice as many as it had during the same time last year. \"I arrived there at 10am sharp, that's when the museum opens, but there were already about a hundred people waiting,\" says Lee Da-geon who hoped to avoid the weekend rush by going on a Monday. But she still left empty-handed: \"Everything I wanted sold out.\" Her wishlist included a badge featuring a tiger and a magpie – the movie's animal characters Derpy and Sussie, which are inspired by folk painting. The soaring sales are a boost for people like Choi Nyun-hee, who runs the craft business Heemuse. \"My revenue has jumped about five-fold,\" she says, adding that her products are now being exported to the US and Australia. She says she discovered Kpop Demon Hunters when the tiger-shaped \"norigae\", a traditional pendant, with mother-of-pearl, \"suddenly started selling out\". Choi had previously worked at a museum, where she developed educational programs on Korean artefacts. After watching the film, she thought \"Korean culture was well-displayed and weaved together into a story\". For others, it's not just the imagery and symbolism that resonated. \"Rumi, the heroine, hides her true self out of embarrassment and shame. I related to that,\" says Lee Da-geon. \"In Korea, people worry far too much about what others think.\" Park Jin-soo, a YouTuber who has worked in the Korean film industry, admits he initially dismissed the movie as \"a bizarre animation based on K-pop,\" but when he finally watched it, he found that he thoroughly enjoyed it. \"I would personally like to see KDH on screen, especially at a time when South Korean cinema is desperately in need of blockbuster movies,\" he says. \"Right now, they are at war over sharing the same pie, but streaming and cinemas each have their own purpose. If they shape trends together and if it goes viral, won't the pie they're fighting over ultimately grow larger? I think KDH can play that role.\" To him, the \"sing-along\" experience - which is something that only a cinema can offer - is one way of turning a streaming hit into a box office blockbuster. More than two months after its release, the film's momentum hasn't slowed – in fact, it's spilling into cinemas. In North America, special \"sing-along\" screenings have made K-pop Demon Hunters Netflix's first number one film at the box office. Now South Korean fans are clamouring for the same experience, with so many of them saying online and offline, \"I want to sing KDH in a cinema!!\" The movie will show at the Busan International Film Festival in September, which has announced limited sing-along screenings this year, though tickets are expected to be scarce. Lee Yu-min, who has watched the film more than five times on Netflix, says she's determined to go if it arrives in the cinema: \"I'll definitely drag my husband along – he hasn't seen it yet.\" \"I'm rooting for KDH screening in South Korea,\" declares a fan online. \"I know nothing has been confirmed, but I'm already starting to memorise all the lyrics.\" Another asks: \"K-pop Demon Hunters is screening in North America, Canada and the UK… so why not in the home of K-pop?\"",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:22.993083"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4g6knz7e65o",
    "heading": "New video appears to show New Zealand fugitive dad with his child",
    "content": "New Zealand police have released fresh CCTV footage believed to show a fugitive who disappeared with his three children more than three years ago . The night-time footage shows two people in full-body clothing - who police are \"confident\" is Tom Phillips and one of his children - apparently breaking into a store before driving away on a quad bike. Detective Senior Sergeant Andy Saunders told a press conference on Friday that the pair had made off with some \"grocery items\". Mr Phillips disappeared into the wilderness with his three children in December 2021. Police believe he took the kids after losing legal custody of them to their mother. Since then a national search has been underway for Mr Phillips and his children: Ember, Maverick and Jayda. Police released the latest footage in hopes that the community would report sightings of them. The apparent break-in happened on Wednesday around 02:00 local time (Tuesday 14:00 GMT) in Piopio, a small town in northern New Zealand. Police said Mr Phillips was believed to have unsuccessfully targeted the same store in November 2023. \"At the heart of this are three children who have been away from their home for four years. Their wellbeing is our main focus,\" Detective Senior Sergeant Andy Saunders said in the police statement. Mr Phillips faces a range of charges including aggravated robbery, aggravated wounding and illegally possessing a firearm, police said. Police previously said that they believed Mr Phillips had assistance from other people. Now they're \"considering what this burglary actually means\", detective Saunders said. \"Does it mean that he's potentially had a falling out with who's helping him? Or is he just that brazen and confident that he's quite happy to come out at night and commit a burglary?\" Last October, Mr Phillips and his three children were publicly spotted for the first time since vanishing, when a group of teenagers spotted them trekking and filmed the encounter. Police said at the time that the children had not been in contact with other people for years and had not received an education. Last year authorities offered a cash reward for information that led to the safe return of the children - but the offer expired before being claimed. Mr Phillips's family has publicly pleaded for him to come home. \"Tom - I feel really sad that you thought you had to do this. Not considering how much we love you and can support you,\" his mother wrote in a note provided to local media. \"It hurts every time I see photos of the children and of you and see some of your stuff that is still here.\"",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-08-29T14:59:25.184626"
  }
]