[
  {
    "url": "https://www.bbc.com/news/articles/clyrkj0d44vo",
    "heading": "Enforcing Australia's social media ban on kids is possible but contains risks, report says",
    "content": "Australia could use a range of technologies to implement its social media ban for under-16s but all have risks or shortcomings, a report has found. The government says its ban, which comes into effect in December, is designed to limit the harmful impacts of social media. The policy has been touted as a world-first and is being watched closely by leaders globally. Under the new laws, platforms must take \"reasonable steps\" to prevent Australian children from creating accounts on their sites, and deactivate existing ones. Though the move is popular with many parents, experts have raised concerns over data privacy and the accuracy of age verification technology. The federal government commissioned the UK-based Age Check Certification Scheme to test the ways Australia could enforce the ban, and its final report was published on Sunday. It looked at a variety of methods - including formal verification using government documents, parental approval, or technologies to determine age based on facial structure, gestures, or behaviours - and found all were technically possible. \"But we did not find a single ubiquitous solution that would suit all use cases, nor did we find solutions that were guaranteed to be effective in all deployments,\" it said. Verification using identity documents was cited as the most accurate method, but the report identified concerns that platforms may keep this data longer than required and was anticipating sharing it with regulators, both of which would leave users' privacy at risk. Australia - like much of the world - has in recent years seen a series of high-profile data breaches, including several where sensitive personal information was stolen and sold or published. Facial assessment technology was 92% accurate for people aged 18 or over, but there is a \"buffer zone\" - about two to three years either side of 16 - in which is it is less accurate. The report said this would lead to false positives, clearing children for accounts, and false negatives, barring users who should be allowed. There are also privacy and accuracy concerns with parental approval methods, it said. It recommended that the methods should be \"layered\" to create the most robust system, and highlighted that many of the technology providers were looking at ways to address circumvention, through things like document forgeries and VPNs (virtual private networks) which obscure the user's country. Communications Minister Anika Wells said there was \"no one-size-fits-all solution\", that the report showed age checks could be \"private, efficient and effective\". \"These are some of the world's richest companies. They are at the forefront of AI. They use the data that we give them for a bevy of commercial purposes. I think it is reasonable to ask them to use that same data and tech to keep kids safe online,\" she told reporters on Monday. \"There is no excuse for social media platforms not to have a combination of age assurance methods in their platforms ready for 10 December.\" Under the ban, tech companies can fined up to A$50m ($32.5m; £25.7m) if they do not take \"reasonable steps\" to bar those aged under 16 from holding accounts. These steps are still to be defined. Facebook, Instagram, Snapchat and YouTube are among the platforms affected. Polling indicates most Australian adults support banning social media for children under 16. However some mental health advocates say the policy has the potential to cut kids off from connection, and others say it could push children under 16 to even-less-regulated corners of the internet. They suggest the government should instead focus on better policing of harmful content on social media platforms and preparing children for the reality of life on the web.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:49.961188"
  },
  {
    "url": "https://www.bbc.com/news/articles/cvgn2ry9510o",
    "heading": "Arrest after fatal shooting of Ukrainian politician Andriy Parubiy",
    "content": "A suspect in the fatal shooting of prominent Ukrainian politician Andriy Parubiy has been arrested, the country's President Volodymyr Zelensky has said. The 54-year-old parliamentarian was killed by an attacker posing as a courier in the western city of Lviv on Saturday, sparking a manhunt. Ukraine's interior minister Igor Klymenko said in a statement issued in the early hours of Monday morning that the suspect had been detained in the western Khmelnytskyi region. Parubiy rose to prominence during Ukraine's Euromaidan mass protests, which advocated closer ties with the EU and brought down pro-Russian former President Viktor Yanukovych in 2014. Klymenko said the preliminary investigation had found the killing had been \"carefully prepared\" with Parubiy's travel schedule and route mapped out, as well as an escape plan. He added that Ukraine's national police force would provide further details later. In a social media post, Zelensky said he had spoken to chief prosecutor Ruslan Kravchenko who advised that the suspect had given an initial testimony. \"Urgent investigative actions are currently underway to establish all the circumstances of this murder,\" he added, while also thanking law enforcement and prosecutors for \"working around the clock\". Unverified footage, purportedly of the shooting, appeared to show a gunman dressed as a courier approaching Parubiy on the street and holding up a weapon as he walked behind him. At a news briefing on Saturday, Lviv police chief Oleksandr Shliakhovskyi said the attacker had \"fired about eight shots from a firearm\". Sources inside Ukraine's law enforcement agencies told the BBC that the attacker had dressed to look like a worker from delivery company Glovo. The company said it was \"deeply shocked\" by the crime and would co-operate fully with an investigation. Parubiy was the speaker of the country's parliament from April 2016 to August 2019. He was one of the leaders of demonstrations in 2013-14 which called for closer ties with the European Union. He organised its \"self-defence\" teams who guarded the sprawling tent camp in the heart of the capital Kyiv during the protest.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:50.132431"
  },
  {
    "url": "https://www.bbc.com/news/articles/cm214r5rd29o",
    "heading": "Hamas spokesman Abu Obeida killed in Gaza, Israel says",
    "content": "Abu Obeida, the spokesman for Hamas's armed wing, has been killed in an aerial attack in Gaza City, Israel has said. Israel's Defence Minister Israel Katz congratulated the Israel Defense Forces (IDF) and Israel's security agency, Shin Bet, for the \"flawless execution\" in a post on X. Hamas has not confirmed his death. The Palestinian armed group earlier said dozens of civilians were killed and injured in the Israeli air strikes on a residential building in the district. Local journalists reported that at least seven people had been killed and 20 injured in the strikes on the densely populated al-Rimal neighbourhood of Gaza City, with children among the casualties. Saturday's attack comes amid ongoing aerial strikes on Gaza City ahead of a planned Israeli offensive. Katz warned on Sunday that many more of Obeida's \"criminal partners\" would be targeted with \"the intensification of the campaign in Gaza\" - a reference to a recently approved Israeli plan to seize control of Gaza City. Separately, the IDF and Shin Bet offered more details about Saturday's strikes that targeted the Hamas spokesman. They said in a joint statement that the operation had been \"made possible due to prior intelligence gathered by [Shin Bet] and the IDF's Intelligence Directorate\" that had identified his hiding place. Obeida was among the few remaining senior members of Hamas's military wing from before its deadly 7 October 2023 attack on southern Israel. Five missiles struck the second and third floor of the six-storey apartment in the al-Rimal neighbourhood building simultaneously from two different directions. The flat that was targeted had been used as a dentist's surgery. Witnesses reported seeing hundreds of thousands of dollars flying in the air after the strikes, with large sums stolen by locals but later recovered by Hamas. The joint statement said Obeida \"served as the public face of the Hamas terrorist organization\" and \"disseminated Hamas' propaganda\". Over the past few years, Obeida - believed to be about 40 years old - delivered a number of long diatribes against Israel on behalf of Hamas's military wing, the al-Qassam Brigades. Always masked in a Palestinian scarf, he became an idol to Hamas supporters throughout the Middle East. In what may have been his final speech on Friday, Obeida said the fate of remaining Israeli hostages would be the same as that of Hamas fighters, warning Israel against its planned invasion of Gaza City. Mohammed Emad, who runs a barbershop just 100m (328ft) from the hit building in al-Rimal, told the BBC that \"the blasts were terrifying - I couldn't move for more than an hour\". He added: \"I can't believe I'm still alive. I saw injured children with blood covering their faces, and people were running in every direction as if the world had ended.\" Footage verified by the BBC of the aftermath of the strikes shows terrified residents fleeing into the streets. Blood can be seen flowing from a body covered by fabric, while an injured child is carried away by a man. The IDF said that prior to the attack \"many steps were taken to reduce the chance of harming civilians, including the use of precision weapons, aerial observations, and additional intelligence information\". BBC News has been unable to independently verify the claims of either the IDF or Hamas. In early August, Israel's security cabinet approved a plan to seize control of Gaza City in a fresh offensive, with the stated aim of bringing the 22-month-long war to an end. The UN has repeatedly warned that a complete military takeover would risk \"catastrophic consequences\" for Palestinian civilians and Israeli hostages held in Gaza. The UK's ambassador to Israel has said it would be \"a huge mistake\". Israeli Prime Minister Benjamin Netanyahu has vowed to defeat Hamas and defied international criticism of his plans to expand the war. Israel's military operation in Gaza began in response to the Hamas-led 7 October attack, in which about 1,200 people were killed and 251 others were taken hostage. Since then, more than 63,000 Palestinians have been killed, according to the Hamas-run Gaza health ministry. While the operation to capture Gaza City has yet to begin in earnest, Israeli attacks on the city - where nearly a million people live - have been ongoing. One local resident told the BBC that the same apartment building struck on Saturday had already been hit in an earlier Israeli air raid months ago. The Israeli military has said it plans to evacuate Gaza City's entire population and move it to shelters in the south before troops move in. Most of Gaza's population has already been displaced many times during the conflict. More than 90% of the city's homes are estimated to be damaged or destroyed, and the healthcare, water, sanitation and hygiene systems have collapsed. Last week, conditions of famine were confirmed in Gaza City and its surrounding areas for the first time.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:50.286887"
  },
  {
    "url": "https://www.bbc.com/news/articles/cp37e8kw3lwo",
    "heading": "Modi and Xi meet: Trump as the wildcard and other takeaways",
    "content": "Just a few months ago, the armed forces of India and Pakistan were locked in a brief but deadly conflict. The conflict indirectly involved a third nation – China. Pakistan's armed forces heavily used China-made equipment, including fighter jets and radar systems. A senior army officer in Delhi said Beijing also provided \"live inputs\" to Pakistan on Indian positions. India didn't take a public stand against China, but this left many asking if Delhi should continue on the path of normalising relations with Beijing. Less than six months later, peace talks between the two Asian giants have been turbocharged by decisions taken thousands of miles away in Washington DC. The Trump administration has imposed 50% tariffs on Indian imports, saying Delhi was being punished for its refusal to stop buying oil from Russia. Delhi had two clear choices after this stunning onslaught from a trusted ally. The first was to cave in and stop buying Russian oil. But it has refused to do so, largely because Russia is an \"all-weather\" ally and giving into pressure doesn't suit Indian Prime Minister Narendra Modi's strongman image. The second was to stand firm and seek other opportunities and India appears to have to chosen this option for now. It's also pragmatic to look no further when your neighbour is the world's second-largest economy and a global manufacturing powerhouse. It was in this context, that Modi met Chinese President Xi Jinping in Tianjin over the weekend. Statements from the two sides were not heavy on details, though they promised to work through their differences to benefit their collective population of 2.8 billion people. The immediate takeaway from the meeting was the resumption of direct flights between the two countries and making the process of issuing visas simpler. But beyond the promise of \"the elephant and the dragon\" coming together, the two countries still have major roadblocks to clear before they are able to engage meaningfully. Their first challenge comes from their immediate history. Modi has invested personally in the India-China relationship since coming to power in 2014, visiting the neighbouring country five times until 2018. But the 2020 border clash put brakes on this momentum and it has taken seven long years for Modi to visit China again. The key to making further progress will depend on how the two countries deal with their border issues. Tens of thousands of troops from both countries are still deployed at their contested borders - though there are ongoing talks between their civilian and military leaders to ease the situation. Both Chinese and Indian readouts after the meeting this weekend talked about maintaining peace at the border and \"not turning their differences into disputes\". For India, there is the issue of a burgeoning trade deficit with China, amounting to more than $99bn (£73bn). Both countries still have high tariffs and duties against each other in many sectors. Beijing would want India to open its market of 1.4 billion people to Chinese products, but Delhi would be wary of doing that without addressing the deficit. The outreach to China, which started with Modi meeting Xi in Kazan last year, may have been supercharged by Trump tariffs, but ground realities for India remain unchanged. The Modi-Xi meeting is being seen as part of India's policy of \"strategic autonomy\" but it will also cause more geopolitical challenges for Delhi. India is due to host the Quad (which includes Japan, Australia and the US) summit later this year. The forum was largely seen as a challenge to China's dominance in the Indo-Pacific region. It's not clear if Trump will attend, but if he does and says something against China, it will immediately test the renewed synergy between Delhi and Beijing. Delhi is also part of several other multilateral forums that are perceived as anti-China and anti-Russia. How Delhi plays its strategic autonomy in the next few months will very much influence the direction India-China ties take. For now, it's clear that India-US ties are at an all-time low. A Trump aide recently called the Russia-Ukraine conflict \"Modi's war\". Delhi has also consistently denied that Trump played any role in the ceasefire between India and Pakistan in May – this has become a constant irritant for the US president. Despite this, India has refrained from imposing retaliatory tariffs against the US and has left the door ajar for further negotiations. After all, the US is India's biggest trading partner. Will going closer to China help India's negotiations with the US or will it have the opposite impact? This is the question that will likely dominate geopolitical discussions in Delhi and beyond in the coming months. When Xi Jinping met Narendra Modi he used what has become his favourite catchphrase for China-India relations: \"The dragon and the elephant should come together\". During \"this period of transformation,\" he added that it was vital for the world's most populous nations to be friends and good neighbours. In a case of spectacular timing, Prime Minister Modi's visit has coincided with Donald Trump's tariffs of up to 50% on India exports to the US. This represents quite a hit on the country's economy so New Delhi would be looking around for other business partners. Look no further than right here, Xi may well say, as his administration attempts to rebuild from the wreckage of China-India relations following years of tension between the two. And, if their official readouts are anything to go by, Modi's attendance at the Tianjin Summit of the Shanghai Cooperation Organisation seems to have paid off. His published comments to Xi were much more specific than the those coming the other way. There is now a very good window for Beijing and New Delhi to repair their strained relationship. China's leader knows that Donald Trump's tariff onslaught is pushing India away from the United States and that this great economic rival needs other partnerships. Considerable obstacles remain. They include China's backing of India's key rival Pakistan; interaction of all types has been in the doldrums; angry rhetoric from both governments (over many years) has created a climate of suspicion between the Asian heavyweights and their high-mountain border dispute has stirred nationalist sentiment on both sides of the frontier. However, with the latter of these, this meeting would appear to confirm that pressure has already eased. Last Thursday China's Defence Ministry spokesman was talking up the success of discussions between the representatives of China and India aimed at stopping the clashes along their disputed border. He spoke of \"win-win cooperation\" and celebrating the 75th anniversary of ties between the two nations. Xi also knows that the symbolism of having Modi in China right now is considerable, that images of them shaking hands and standing side-by-by side – as the Trump tariffs on India kick in – can be a powerful propaganda tool which is made even more significant by the fact that this is a multilateral gathering. The two will not only be joined by Vladimir Putin but by the other SCO governments like Turkey (a member of Nato), Saudi Arabia (a key US ally), Iran (a key enemy of the US) as well as Qatar, Egypt and Pakistan. And all of this in the days before Beijing holds a massive display of military might with a parade through the heart of the capital.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:50.440465"
  },
  {
    "url": "https://www.bbc.com/news/articles/clyrk2kxlngo",
    "heading": "Indonesian politicians to have perks cut in bid to quell unrest",
    "content": "Indonesian political parties have agreed to reverse some state-funded perks their politicians receive in a bid to quell nationwide protests, the country's president has said. Several cities in the southeast Asian nation including the capital, Jakarta, have been gripped by anti-government demonstrations in the past week that have at times led to clashes between protesters and police. While the protests have been fuelled by a wide range of issues - including the death of a ride-sharing driver - one core complaint concerns a new monthly allowance for lawmakers. President Prabowo Subianto announced on Sunday that several perks would be reined in, including the size of some allowances. The Indonesian leader - who has already had to cancel a trip to China over the unrest - said some demonstrations had gone beyond what was considered peaceful and may amount to \"treason and terrorism\". He added that he had ordered the police and armed forces to take strong action against looting and property damage. The home of Indonesia's finance minister Sri Mulyani Indrawati was among several targeted by looters on Sunday, news agency AFP reports. The protests have primarily centred on an increase of 50 million rupiah ($3,030; £2,250) in parliamentarians' allowances - almost 10 times the minimum wage in Jakarta. But they escalated after Affan Kurniawan, a 21-year-old ride-sharing driver, was run over by a police vehicle during a demonstration in the capital on Thursday. The incident inflamed tensions and prompted accusations that police were using excessive force to deal with protesters. Seven officers were found to have violated a professional ethics code and an investigation into the incident has been launched. Ride-hailing and delivery drivers in Indonesia have long argued that their pay and conditions are unfair. The death of one of their own brought shows of solidarity amongst their ranks. Prabowo and the chief of police both issued public apologies for the incident, with the president saying he was \"shocked and disappointed\" by the officers' actions. Three people were killed after protesters set fire to a regional parliament building on Friday evening. Over the weekend protests continued, with police in central Jakarta firing tear gas to disperse crowds on the streets, while some demonstrators threw Molotov cocktails and firecrackers at a police compound. Rehayu Saraswati, a member of the ruling party in Indonesia, told the BBC the large-scale protests had come as \"quite a surprise\". \"I don't think any of us saw this coming,\" she told BBC Newshour. \"It happened very, very quickly within a matter of days.\" Ms Rehayu Saraswati rejected protesters' suggestion that the government was being \"tone deaf\". \"We understand that the situation is difficult, and that the economy has been quite, I would say, challenging for some people,\" she said. The recently announced cuts to the parliamentary budget and allowances, she added, were \"a way to show that we are listening\". Prabowo did not specify which lawmakers would have their allowances curtailed, but said a moratorium on overseas trips would also be imposed. However, the concessions to the protesters may not quell the widespread dissent. Muzammil Ihsan, head of the All Indonesian Students' Executives Body, the country's largest student group, told Reuters that the move was \"not enough\" and that further demonstrations were being considered. \"The government must resolve deep-rooted problems,\" he said. \"The anger on the streets is not without cause.\" Protesters have demanded higher wages, lower taxes and stronger anti-corruption measures. The demonstrations have been seen as the first significant test for Prabowo's leadership since he assumed the presidency in October. The former general has been dogged for decades by allegations of human rights abuses, and his critics have expressed concerns of Indonesia returning to its authoritarian past - though Prabowo pledged greater stability and economic development during his election campaign.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:50.952957"
  },
  {
    "url": "https://www.bbc.com/news/articles/cpv0w7njj2jo",
    "heading": "Sergio Gor: Trump's 'great friend' and the new India envoy",
    "content": "He's published books authored by Donald Trump, raised millions for his 2024 campaign, and helped him staff Washington with loyalists during the US president's second term. Now Sergio Gor is set to become Trump's man in India, while also overseeing US relations with other South and Central Asian countries. Last week, Trump announced that he was promoting Gor, his personnel chief, to be the next US Ambassador to India. He called Gor a \"great friend\" and someone he could \"fully trust\" to deliver on the agenda. The 38-year-old's appointment comes at a time when relations between the two countries have become strained due to Trump's punishing tariffs on India. Gor's appointment has evoked mixed reactions in India, with some observers saying that having a close Trump aide in the post is a positive sign for India-US ties. But others have questioned Trump's decision to share his India envoy with South and Central Asian countries, which includes Pakistan, with whom India shares a tense relationship. Experts say that Gor's broad regional mandate threatens to expose India to an overreach by Washington in its affairs with Pakistan, including on the Kashmir issue - a red line for India. \"The special envoy's additional designation will likely create some challenges, at least in India. India typically prefers not to be \"hyphenated\" with Pakistan,\" says Alyssa Ayres from the Council of Foreign Relations, an American think-tank focussed on US foreign policy. Lawrence Haas, a former senior White House official and senior fellow at the American Foreign Policy Council, says that it could also be Trump's way of signalling to Delhi that he doesn't think the role of ambassador to India needs to be a full-time job. \"I imagine that India's leaders will feel slighted and insulted, which will further strain US-India relations,\" Mr Haas told the BBC. India found itself in a similar situation in 2009, when the Obama administration reportedly considered appointing Richard Holbrooke as special envoy to Pakistan, Afghanistan and India. Delhi reportedly lobbied against the move, leading to Holbrooke being appointed envoy to Pakistan and Afghanistan. Trump, however, is no Obama. Unlike his predecessor's caution, Trump openly claimed credit for brokering an end to a recent four-day conflict between India and Pakistan - a claim India flatly denied, insisting no outside power played a role in the ceasefire. The Trump administration has also been bullish in its demands from India in a prospective trade deal, seeking greater access to dairy and farming, sectors India has been keen to protect. It remains to be seen if Gor's presence in India will help smooth out such bumps and strengthen Washington-Delhi ties, or if he is here to crack the whip on Trump's biddings. Bill Drexel, a fellow at the Center for Strategy and American Statecraft at the Hudson Institute, says that because decision-making is largely driven by Trump, having an India envoy who's close to him could be a major asset to India-US ties. \"But there may be a steep learning curve given his [Gor's] limited diplomatic and regional experience,\" Mr Drexel says. Ms Ayres echoes a similar view. She says that Gor's closeness with the president could help \"break through\" potential policy logjams. Mr Haas, however, says that Gor's lack of diplomatic experience could pose a problem in an already strained relationship and that the US should have picked an envoy who could help improve the situation. \"Instead, I suspect that Delhi will interpret this appointment as a slap in the face and further evidence that Trump doesn't care about the relationship,\" he says. Gor is said to get along not just with Trump but the entire Trump clan, including Ivanka Trump, Jared Kushner and Donald Trump Jr. Kushner has called Gor \"easygoing\" and \"trusted\". Former congressman Matt Gaetz recalled his fun-loving side, noting he once DJed at MAGA parties in Palm Beach during Trump's exile. Western media, however, largely cast him as one of Trump's most reliable foot soldiers - someone who gets the job done. Gor is known for vetting presidential appointees for loyalty to Trump. In June, Elon Musk branded him a \"snake\" after The New York Post reported that Gor had not filed the paperwork for his own permanent security clearance. The White House insisted Gor held an active clearance and is \"fully compliant\" with requirements. Gor's origins are both unclear and interesting. Though he has been known to describe himself as being Maltese, he was born in 1986 in Uzbekistan when it was still a part of the Soviet Union. He reportedly spent much of his childhood in Malta before moving to the US at 12. Gor is reported to have been interested in Republican politics from his school and college days, when he went by the name Gorokhovsky, which he later shortened to Gor. In 2008, he became a junior staffer at the Republican National Committee and one of his jobs included wearing a squirrel costume at events to highlight Barack Obama's ties to an organisation Republicans accused of indulging in voter fraud. After two years at Fox News, Gor worked with several Republican politicians before joining Trump's fundraising team in 2020. A year later, he co-founded Winning Team Publishing with Donald Trump Jr., which has since released multiple Trump books, including the photobook Save America. Since 2022, he has owned a house in Florida, a short drive from Mar-a-Lago, where he is a frequent visitor. Follow BBC News India on Instagram, YouTube, Twitter and Facebook.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:51.398837"
  },
  {
    "url": "https://www.bbc.com/news/articles/crm4gdwerj3o",
    "heading": "Former NYC Mayor Rudy Giuliani injured in car accident",
    "content": "Former New York City mayor Rudy Giuliani has been injured in a car accident in the US state of New Hampshire. Giuliani was a passenger in a Ford Bronco when it was struck from behind in the city of Manchester on Saturday evening, according to local police. \"He was diagnosed with a fractured thoracic vertebrae, multiple lacerations and contusions, as well as injuries to his left arm and lower leg,\" a statement from his security guard, Michael Ragusa, said. Giuliani, 81, became known as \"America's Mayor\" after leading New York through 9/11. He later became an adviser and then personal lawyer to Donald Trump, though the two have since parted ways. All involved in the crash suffered non-life threatening injuries and were taken to hospital, police said. The incident happened shortly after Giuliani had helped an alleged victim of domestic violence who had flagged him down on a road, Mr Ragusa's statement added. \"Mayor Giuliani immediately rendered assistance and contacted 911,\" he said. New Hampshire police confirmed officers were investigating a reported domestic violence incident when they saw the crash on the opposite side of the road. \"As a result of the collision, both vehicles went into the median and were heavily damaged,\" police added. Investigators said they have identified the driver who allegedly struck Giuliani's car, although no charges have been filed and the crash is under investigation. First elected New York City mayor in 1993, Giuliani was in charge at the time of the 11 September attack on the World Trade Center in 2001. In 2008, he made an unsuccessful run for US president, and later became one of Trump's advisers during the latter's 2016 campaign. He joined Trump's personal legal team in 2018 and remained a part of it through to the 2020 election. In the aftermath of Joe Biden's 2020 election victory over Trump, Giuliani spread baseless claims the election was stolen. Earlier this year, he reached a tentative settlement with two former election workers who won $148m (£120m) in damages after they successfully sued him for defamation over false election fraud claims.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:51.587355"
  },
  {
    "url": "https://www.bbc.com/news/articles/c209ql9z2d1o",
    "heading": "Camilla fought off attacker with shoe as teenager, book says",
    "content": "Queen Camilla was the victim of an attempted indecent assault as a teenager, according to a new book about the Royal Family. The Queen is said to have fought off her attacker using the heel of her shoe. The attempted assault is recounted in Power and the Palace by the former Royal editor of the Times newspaper, Valentine Low. He says the Queen told Boris Johnson the story of her experience in 2008 when he was mayor of London. It is reported that the Queen was 16 or 17 years old when the incident happened on a train to Paddington Station. The man is said to have been touching the teenage Camilla Shand when she took off her shoe and hit him with it. It was, she told Johnson, something her mother had told her to do if she ever found herself in that situation. When she arrived in London, she reported the incident to station staff and the man was arrested. Buckingham Palace has made no official statement on the story but is not disputing the details of the account. Much of the Queen's public work in recent years has been supporting the victims of domestic violence, sexual assault and rape. She is patron of the charity SafeLives and has visited women's refuges and rape crisis centres across the UK and globally. In a number of powerful speeches, she has spoken of the courage of those who have experienced domestic violence and why they should not feel fear or stigma in coming forward. In a speech in 2020 she said: \"Through my work, I have talked to many women who have lived with coercive control and domestic violence and, thankfully, come out at the other end as the victors not the victims. \"They are some of the bravest people I have ever met. Their stories are harrowing and have reduced even the toughest of their listeners to tears.  That is why it is so vital that these survivors should no longer feel any shame or any blame.\" And at a reception at Clarence House in April for SafeLives, she spoke of domestic abuse. \"I would not be standing here if it was 10 years ago because we wouldn't have been talking about it - it was a taboo subject. Nobody actually wanted to talk about it. \"But now 10 years later we've got survivors telling their story who years ago would've been too ashamed to come forward to tell their stories, but now they'll get up and talk and inspire others to talk.\" Sources close to the Queen say she has not gone public with the attempted attack before to avoid drawing attention to her experience rather than to the victims she now works with. They also say this episode did not motivate the Queen to get involved in supporting domestic violence organisations as that work stemmed from hearing victims stories over the years. Royal sources also say if discussion around the Queen's past experience helps destigmatise what far too many girls still suffer today, then that would be a positive from what was a negative episode. Details of help and support with child sexual abuse and sexual abuse or violence are available in the UK at BBC Action Line.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:52.804897"
  },
  {
    "url": "https://www.bbc.com/news/articles/c7072kjdz1zo",
    "heading": "Man arrested after crashing car into Russian consulate in Australia",
    "content": "A man has been arrested after driving a car through the gates of the Russian consulate in Sydney. Police were called to the consulate in the suburb of Woollahra around 08:00 local time, following reports that an unauthorised vehicle was parked in the driveway. They attempted to speak to the driver, before he allegedly crashed through the gates at the property's entrance. The 39-year-old was arrested at the scene and is assisting police with their inquiries, police said. One officer suffered an injury to his hand, but there were no other reports of injuries. Police have revealed no further information about the driver or their motivation, but say inquires are ongoing. A witness told the Sydney Morning Herald that the man was arrested without an apparent struggle. \"I just saw the policemen draw their guns at the gentleman, asking the gentleman to come out of his car,\" a neighbour, who wished to remain anonymous, told the newspaper.",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:53.312677"
  },
  {
    "url": "https://www.bbc.com/news/articles/c4gmnpg31xlo",
    "heading": "China's huge navy is expanding at breakneck speed - will it rule the waves?",
    "content": "\"Socialism is good…\" a pensioner warbles into a portable karaoke mic, slightly off-key and drowned out by her friends' chatter. But they join her for the chorus: \"The Communist Party guides China on the path to power and wealth!\" It is not the catchiest karaoke number. But it is an apt one to belt out as they look towards a horizon framed by cranes towering over ships of all sizes. Suoyuwan park in Dalian, which juts out of north-eastern China into the Yellow Sea,  has stunning views of one of China's largest shipyards, and is a place to gather and be merry. But to White House analysts thousands of miles away in Washington, this cradle of Chinese shipbuilding is part of a growing threat. In the last two decades, China has ramped up investment in shipbuilding. And that has paid off: more than 60% of the world's orders this year have gone to Chinese shipyards. Put simply, China is building more ships than any other country because it can do it faster than anyone else. \"The scale is extraordinary… in many ways eye-watering,\" says Nick Childs, a maritime expert with the London-based International Institute for Strategic Studies. \"The Chinese shipbuilding capacity is something like 200 times overall that of the United States.\" That commanding lead also applies to its navy. The Chinese Communist Party now has the world's largest, operating 234 warships compared to the US Navy's 219. China's explosive rise has been fuelled by the sea. The world's second-largest economy is home to seven of the world's 10 busiest ports, which are critical to global supply routes. And its coastal cities are thriving because of trade. As Beijing's ambitions have grown, so has its arsenal of ships - and its confidence to stake a louder claim in the South China Sea and beyond. President Xi Jinping's China certainly wants to rule the waves. Whether it will is the question. A grand military parade in the coming days may reveal just how close it is to that goal. Xi will host Russian President Vladimir Putin and North Korea's leader Kim Jong Un for the event in a defiant message to the Western nations that have shunned them. The US and its allies will be closely watching the photo-op and the display of military might, which is expected to include anti-ship missiles, hypersonic weapons and underwater drones. \"The US Navy, while it still has significant advantages, is seeing the gap in its capabilities with China narrow and is struggling to find a way of answering that,\" Mr Childs says, \"because its shipbuilding capacity has dwindled significantly over the past decades.\" US President Donald Trump has said he wants to fix this, and has signed an executive order to revitalise US shipbuilding and retake America's maritime advantage. That, Mr Childs adds, will be a \"very tall order\". Between 2019 and 2023, China's four largest shipyards - Dalian, Guangzhou, Jiangnan and Hudong-Zhonghua - produced 39 warships with a combined displacement of 550,000 tonnes, according to a study by the Center for Strategic and International Studies (CSIS). That is the volume of water they displace, which is the most common way of measuring the size of a vessel or fleet. In comparison, the UK's Royal Navy currently has an estimated total displacement of around 399,000 tonnes. While China has the world's largest navy by number of vessels, the US fleet has a greater overall tonnage and is more powerful - with far more large aircraft carriers. But Beijing is catching up. \"There's no sign that the Chinese are slowing down,\" says Alexander Palmer from the CSIS and author of the report, Unpacking China's Naval Buildup. \"Hull count [number of ships] is not the only measure of a navy's effectiveness of course, but the ability to produce and churn out warships has been extremely impressive and could make a strategic difference.\" There are still limits on China's naval rise. Beijing may have more ships, but it only has two operational aircraft carriers, and its navy has far fewer submarines than the US. Some analysts argue they are also not as sophisticated as the American ones, which have a technological head start going back to the the Cold War. The Chinese subs are also largely built for the shallower South China Sea, where a game of cat-and-mouse with the US is already under way. For now, China's ability to travel far from its own coastline is limited. But there are signs this is changing, and fast. Satellite imagery obtained by BBC Verify from Hainan, a Chinese island province in the South China Sea, suggests Beijing is pouring significant funding into expanding its naval bases. The base at Yulin has five new piers which appear to have been constructed in the last five years. It is thought China plans to base all of its largest submarines, the Jin-class (or Type 094), in this port. These new subs can carry 12 nuclear missiles each. Photographs and footage of rehearsals, shared on Chinese social media, suggest that at least two new types of unmanned underwater drones, which look like large torpedoes, will be among the new systems on show at next week's parade. These could allow China to carry out surveillance deep underwater and detect other submarines or even undersea cables without risking its own naval forces. Much of the technology is still \"unproven and the timeline of its capabilities is still unclear\", cautions Matthew Funaiole from CSIS's China Power Project. \"The big question is how long will it take for the technology to mature.\" And that's why the US cannot overlook the threat China's shipbuilding represents, he adds. The country's vast naval buildup is being propelled by a party that is still reeling from the pains of the past - and is more than willing to channel them to buttress its message of loyalty, power and patriotism. Holding a massive military parade to commemorate the victory over Japan, and the end of its brutal occupation, is testament to that. What the rest of the world sees as China's rise, Xi sees as its resurgence. He has touted the value of a \"strong navy to safeguard national security\". He cites 470 invasions between 1840 and 1949 that brought \"untold suffering\" - as the once-powerful Qing empire cracked, China plunged into turmoil, revolution and civil war. And he has vowed that his country will never again be \"humiliated\" or relive those \"bitter memories of foreign assaults\". Where China has an undeniable edge is the dual use of shipyards. Many of those that support commercial production can also help produce warships for the navy. Military and civilian shipyards work hand in hand in some places, which state media describes as \"military-civilian fusion\", a concept Xi has pushed hard. Dalian, which Beijing calls a \"flagship shipyard\", plays a big part in this. In full view of the picnicking pensioners waving karaoke mics are huge commercial ships, some as long as three football fields. But just around the corner, berthed where no-one can take pictures, is a group of military vessels. There, a crane is lowering a helicopter onto the huge deck of a ship, as a marching band bellows in Suoyuwan park. \"This is a politically motivated agenda to merge both the commercial and military entities together,\" Mr Funaiole says. \"There are efforts to bring the technology needed to build both into a centralised location – Dalian is one of them.\" That is why even without powerful aircraft carriers or submarines, China's commercial fleet and its expertise in building ships quickly can be key during a crisis, he adds. \"In any protracted conflict, if you have shipyards that quickly produce new ships, this is a huge strategic advantage,\" Mr Funaiole says. \"Commercial ships can transport food etc into any conflict zone. Without this, the US is in a position where it might not be able to sustain a prolonged war effort.\" It boils down to a straight question, he says: \"Who can put more assets into the water more quickly and readily?\" The answer, at the moment, is China. But the world should not worry, says Prof Hu Bo, director of the Center for Maritime Strategy Studies at Peking University. \"We have no interest in interfering in the business of other countries, especially militarily,\" he adds. His message is that China is building big ships because it can, not because it wants to take over the world. There is one island which China does not see as another country: Taiwan. Beijing has long vowed to \"reunify\" with the democratic island and has not ruled out the use of force. In recent years, high-ranking US officials have declared that China will invade Taiwan by 2027, but Beijing denies there is a deadline. \"China already has the capacity to take Taiwan back,\" Prof Hu Bo says, \"but China doesn't do that because we have patience. China has never given up on the prospect of peaceful unification. We can wait.\" The bigger concern is that any attack on Taiwan could trigger a wider war, and involve the US. Washington is bound by law to provide arms to help Taiwan defend itself - support which is unacceptable to Beijing for what is considers a breakaway province that will eventually be part of China. Earlier this year US Defence Secretary Pete Hegseth warned that China posed an \"imminent\" threat to Taiwan, and urged Asian countries to boost defence spending and work with the US to deter war. So despite Prof Hu Bo's assurances, it is hard to ignore the fact that China's warships are beginning to sail further from the country's shores. In February, they were seen circumnavigating Australia's coastline for more than three weeks where they staged unprecedented live-fire drills. More recently Chinese aircraft carriers conducted naval drills near Japan, sparking concern - although it was in international waters, the move was unprecedented. As Beijing grows bolder in its attempts to project power in the Pacific, China's neighbours, from Taiwan to Australia, are worried that its famous mantra is paying off: \"hide your strength and bide your time\". But Prof Hu Bo believes that fears of a conflict between the US, whose allies in the region - Japan, South Korea and Australia - are often at odds with China, are overblown, because they all know it could be catastrophic. \"In the last three years, I think the signal is very clear that both sides don't want to fight,\" he says. \"We are prepared for that, but we don't want to fight with each other.\" Back in Dalian, around an hour's drive from the vibrant city, tourists are arriving by the coach load in the naval fortress town of Lushunkou, which also has a military theme park in the shape of an aircraft carrier. Guides on loud microphones lead their groups into the park, pointing to the official notices warning visitors not to photograph the military vessels moored in the crescent-shaped harbour and to report any behaviour that might be construed as spying \"to help defend the Motherland\". More military notices on bridges and walls declare, \"united as one, we defend our ocean dream\". China has fostered pride in its shipbuilding prowess, especially here in Dalian. At the theme park, which also overlooks the shipyard, a 50-year-old blogger dressed in the local fashion - a floral pattern shirt - is giving his followers their daily rundown of the latest ships being built in the port. \"I am very proud – really, look at what this city gives us,\" he announces to his followers. A mother and her seven-year-old daughter, on holiday from the neighbouring province, marvel at the ships. \"I was amazed. It's huge. How does it sail, I wonder?\" The key question for the US and its allies is how far can China's war fleet sail, and how far from its shores is Beijing prepared to venture. \"At what point will they will break out and be able to really show influence further afield, for example, in the Indian Ocean and beyond, will be a key thing to look at,\" Nick Childs says. \"They still have a significant way to go, but they are certainly pushing the boundaries.\"",
    "keywords": [],
    "source": "BBC News",
    "timestamp": "2025-09-01T10:43:53.804029"
  }
]